org/probabilidad/02_1.org
#+title:Variables aleatorias
* Variables aleatorias
Sea $(\Omega, \mathcal{A},\mathbb{P})$ un espacio de probabilidad. Una variable aleatoria sobre \Omega es una función
X : \Omega \rightarrow \Re  tal que para todo x \in \Re}
\{X \leq x\} := \{\omega \in \Omega : X(\omega) \leq x\} \in A, 
i.e., para to do x \in \Re el evento \{X \leq x\} tiene asignada probabilidad. La función de distribu
ción F}
X
: R \rightarrow [0, 1] de la variable aleatoria X se define por
F_X(x) := \mathbb{P}(X \leq x).
Cálculo de probabilidades. La función de distribución resume (y contiene) toda la in
formación relevante sobre de la variable aleatoria. Para ser más precisos, para cada pareja de
números reales a < b vale que
1
\mathbb{P}(a < X \leq b) = F
X
(b) − F
X
(a). (1)
**** Ejemplos
**** Ejemplo 1.1 (Dado equilibrado). 
Sea X el resultado del lanzamiento de un dado equilibrado.
Los posibles valores de X son 1, 2, 3, 4, 5, 6. Para cada k \in \}1, 2, 3, 4, 5, 6{\} la probabilidad de
que X tome el valor k es 1 / 6.

Sea x \in \Re} . Si x < 1 es evidente que \mathbb{P}(X \leq x) = 0. Si k \leq x < k + 1 para algún
k \in \{1}, 2, 3, 4, 5{\} la probabilidad del evento \{X \leq x\} es la probabilidad de observar un valor
menor o igual que k y en consecuencia, \mathbb{P}(X \leq x) = k/}6. Finalmente, si x \geq 6 es evidente
que \mathbb{P}(X \leq x) = 1.

x
1/6
2/6
3/6
4/6
5/6
1
1 2 30 4 5 6
Figura 1: Gráfico de la función de distribución del resultado de lanzar un dado equilibrado.
Por lo tanto, la función de distribución de X se puede expresar del siguiente modo
F_X(x) =
6
X
{k=1}
1
6
1\{k \leq x\}.
1
Basta observar que \{X \leq a\} \subset \{X \leq b\} y usar las propiedades de la probabilidad. De la igualdad
\{a < X \leq b\} = \{X \leq b\}  \setminus  \{X \leq a\} se deduce que \mathbb{P}(a < X \leq b) = \mathbb{P}(X \leq b ) − \mathbb{P}(X \leq a) = F}
X
(b) − F
X
(a).
3
**** Ejemplo 1.2 (Fiabilidad). 
Un problema fundamental de la ingeniería es el problema de la
fiabilidad. Informalmente, la fiabilidad de un sistema se define como
su capacidad para cumplir ciertas funciones prefijadas. Esta propiedad
se conserva durante un período de tiempo hasta que ocurre una fa lla
que altera la capacidad de trabajo del sistema. Por ejemplo: rupturas
y cortocircuitos; fracturas, deformaciones y atascamientos de piezas
mecánicas; el fundido o la combustión de las componentes de un
circuito.

Debido a que las fallas pueden ocurrir como hechos casuales, podemos
considerar que el tiempo de funcionamiento, T , hasta la aparición de
la primer falla es una variable aleatoria a valores no negativos.

La fiabilidad de un sistema se caracteriza por su función intensidad de fallas \lambda ( t). Esta 
función temporal tiene la siguiente propiedad: cuando se la multiplica por dt se obtiene la
probabilidad condicional de que el sistema sufra una falla durante el intervalo de tiempo
(t, t + dt] sabiendo que hasta el momento t funcionaba normalmente. Si se conoce la función
\lambda ( t) se puede hallar la ley de distribución de probabilidades de T .
Para calcular la función de distribución de T estudiaremos dos eventos: A := \{T > t\} (el
sistema funciona hasta el momento t) y B := \{t < T \leq t + dt{\} (el sistema sufre una falla en
el intervalo de tiempo (t, t + dt]). Como B \subset A, tenemos que \mathbb{P}(B) = \mathbb{P}(B \cap A) y de la regla
del producto se deduce que
\mathbb{P}(B) = \mathbb{P}(B | A)\mathbb{P}(A). (2)
Si la función de distribución de T admite derivada continua, salvo términos de segundo orden
que se pueden despreciar, la probabilidad del evento B se puede expresar en la forma
\mathbb{P}(B) = \mathbb{P}(t < T \leq t + dt) = F
T
(t + dt) − F
T
(t) = F}
′
T
(t)dt. (3)
La probabilidad del evento A se puede expresar en la forma
\mathbb{P}(A) = \mathbb{P}(T > t) = 1 − \mathbb{P}(T \leq t) = 1 − F 
T
(t). (4)
Finalmente, la probabilidad condicional \mathbb{P}(B | A) se expresa mediante la función intensidad de
fallas \lambda(t):
\mathbb{P}(B | A) = \lambda(t)dt (5)
Sustituyendo las expresiones (3)-(5) en la fórmula (2) obtenemos, después de dividir ambos
miembros por dt, una ecuación diferencial de primer orden para F}
T
(t)
F
′
T
(t) = \lambda(t)(1 − F
T
(t)). (6)
Debido a que la duración del servicio del sistema no puede ser negativa, el evento \{T \leq 0{\} es
imposible. En consecuencia, F}
T
(0) = 0. Integrando la ecuación diferencial (6) con la condición
inicial F (0) = 0, obtenemos
2
F
T
(t) = 1 − exp

−
Z
t_0
\lambda ( s ) ds

. (7)
2
F
′
T
(t) = \lambda(t)(1 − F
T
(t)) \iff}
F
′
T
(t)
1 − F
T
(t)
= \lambda(t) \iff}
d
dt
log(1 − F
T
(t)) = − \lambda (t)
\iff log(1 − F}
T
(t)) = −}
Z
t_0
\lambda ( s ) ds + C \iff F
T
(t) = 1 − exp
„
−
Z
t_0
\lambda ( s ) ds + C
«
.
Usando que F}
T
(0) = 0 se deduce que C = 0.
4
**** Nota Bene 
El desarrollo anterior presupone que la función intensidad de fallas \lambda(t) verifica}
las siguientes condiciones: (1) \lambda(t) \geq 0 para todo t > 0 y (2)
R
\infty
0
\lambda ( t ) dt = +{\infty}.
**** Ejemplo 1.3 (Fiabilidad)
Se estipula que la duración de servicio de un sistema automático}
debe ser t_0
. Si durante ese período el sistema falla, se lo repara y se lo utiliza hasta que sirva
el plazo estipulado. Sea S el tiempo de funcionamiento del sistema después de la primera
reparación. Quere mos hallar la función de distribución de S}.
En primer lugar observamos que la relación entre la variable aleatoria S y el instante T}
en que ocurre la primera falla del sistema es la siguiente
S = máx(t}
0
− T, 0) =

t_0
− T si T \leq t_0
,
0 si T > t}
0
.
Sea F}
S
(s) la función de distribución de la variable S}. Es claro que para s < 0, F}
S
(s) = 0 y
que para s \geq t}
0
, F}
S
(s) = 1. Lo que falta hacer es analizar el compor
tamiento de F}
S
sobre el
intervalo 0 \leq s < t_0
. Sea s \in [0, t}
0
)
F
S
(s) = \mathbb{P}(S \leq s) = \mathbb{P}(máx(t_0
− T, 0) \leq s) = \mathbb{P}(t}
0
− T \leq s, 0 \leq s ) 
= \mathbb{P}(t_0
− T \leq s) = \mathbb{P}(t}
0
− s \leq T ) = exp

−
Z
t_0
−s
0
\lambda ( t ) dt

,
donde \lambda(t) es la función intensidad de fallas del sistema.
1
exp
/"
−
R
t_0
0
\lambda ( t ) dt
''
t_0
s{0}
Figura 2: Gráfico de la función de distribución de la variable aleatoria S}.
Por lo tanto,
F
S
(s) = exp

−
Z
t_0
−s
0
\lambda ( t ) dt

1\{0 \leq s < t_0
\} + 1} \{s \geq t_0
\}.
**** Ejercicios adicionales
1. Sea X una variable aleatoria con función de distribución F_X(x). Mostrar que para cada
pareja de números reales a < b vale que:
\mathbb{P}(a \leq X \leq b) = F
X
(b) − F
X
(a) + \mathbb{P}(X = a) (8)
\mathbb{P}(a \leq X < b) = F
X
(b) − \mathbb{P}(X = b) − F
X
(a) + \mathbb{P}(X = a) (9)
\mathbb{P}(a < X < b) = F
X
(b) − \mathbb{P}(X = b) − F
X
(a) (10)
5
Notar que las fórmulas (8)-(10), junto con (1), muestran como calcular l a probabilidad de
que la variable aleatoria X tome valores en un intervalo de extremos a y b y contienen una
advertencia sobre la acumulación de masa positiva en alguno de los dos extremos.
** Propiedades de la función de distribución
