probabilidad/02_1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-18 Mon 00:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Variables aleatorias</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Variables aleatorias</h1>
<div id="outline-container-org6535c3d" class="outline-2">
<h2 id="org6535c3d">Variables aleatorias</h2>
<div class="outline-text-2" id="text-org6535c3d">
<p>
Sea \((\Omega, \mathcal{A},\mathbb{P})\) un espacio de probabilidad. Una variable aleatoria sobre &Omega; es una función
X : &Omega; &rarr; \Re  tal que para todo x &isin; \Re}
\{X &le; x\} := \{&omega; &isin; &Omega; : X(&omega;) &le; x\} &isin; A, 
i.e., para to do x &isin; \Re el evento \{X &le; x\} tiene asignada probabilidad. La función de distribu
ción F}
X
</p>
<pre class="example">
R \rightarrow [0, 1] de la variable aleatoria X se define por

</pre>
<p>
F<sub>X</sub>(x) := \mathbb{P}(X &le; x).
Cálculo de probabilidades. La función de distribución resume (y contiene) toda la in
formación relevante sobre de la variable aleatoria. Para ser más precisos, para cada pareja de
números reales a &lt; b vale que
1
\mathbb{P}(a &lt; X &le; b) = F
X
(b) − F
X
(a). (1)
</p>
</div>
<div id="outline-container-orge891467" class="outline-5">
<h5 id="orge891467">Ejemplos</h5>
</div>
<div id="outline-container-org6354861" class="outline-5">
<h5 id="org6354861">Ejemplo 1.1 (Dado equilibrado).</h5>
<div class="outline-text-5" id="text-org6354861">
<p>
Sea X el resultado del lanzamiento de un dado equilibrado.
Los posibles valores de X son 1, 2, 3, 4, 5, 6. Para cada k &isin; \}1, 2, 3, 4, 5, 6{\} la probabilidad de
que X tome el valor k es 1 / 6.
</p>

<p>
Sea x &isin; \Re} . Si x &lt; 1 es evidente que \mathbb{P}(X &le; x) = 0. Si k &le; x &lt; k + 1 para algún
k &isin; \{1}, 2, 3, 4, 5{\} la probabilidad del evento \{X &le; x\} es la probabilidad de observar un valor
menor o igual que k y en consecuencia, \mathbb{P}(X &le; x) = k/}6. Finalmente, si x &ge; 6 es evidente
que \mathbb{P}(X &le; x) = 1.
</p>

<p>
x
1/6
2/6
3/6
4/6
5/6
1
1 2 30 4 5 6
Figura 1: Gráfico de la función de distribución del resultado de lanzar un dado equilibrado.
Por lo tanto, la función de distribución de X se puede expresar del siguiente modo
F<sub>X</sub>(x) =
6
X
{k=1}
1
6
1\{k &le; x\}.
1
Basta observar que \{X &le; a\} &sub; \{X &le; b\} y usar las propiedades de la probabilidad. De la igualdad
\{a &lt; X &le; b\} = \{X &le; b\}  &setminus;  \{X &le; a\} se deduce que \mathbb{P}(a &lt; X &le; b) = \mathbb{P}(X &le; b ) − \mathbb{P}(X &le; a) = F}
X
(b) − F
X
(a).
3
</p>
</div>
</div>
<div id="outline-container-orgb1b8fa2" class="outline-5">
<h5 id="orgb1b8fa2">Ejemplo 1.2 (Fiabilidad).</h5>
<div class="outline-text-5" id="text-orgb1b8fa2">
<p>
Un problema fundamental de la ingeniería es el problema de la
fiabilidad. Informalmente, la fiabilidad de un sistema se define como
su capacidad para cumplir ciertas funciones prefijadas. Esta propiedad
se conserva durante un período de tiempo hasta que ocurre una fa lla
que altera la capacidad de trabajo del sistema. Por ejemplo: rupturas
y cortocircuitos; fracturas, deformaciones y atascamientos de piezas
mecánicas; el fundido o la combustión de las componentes de un
circuito.
</p>

<p>
Debido a que las fallas pueden ocurrir como hechos casuales, podemos
considerar que el tiempo de funcionamiento, T , hasta la aparición de
la primer falla es una variable aleatoria a valores no negativos.
</p>

<p>
La fiabilidad de un sistema se caracteriza por su función intensidad de fallas &lambda; ( t). Esta 
función temporal tiene la siguiente propiedad: cuando se la multiplica por dt se obtiene la
probabilidad condicional de que el sistema sufra una falla durante el intervalo de tiempo
(t, t + dt] sabiendo que hasta el momento t funcionaba normalmente. Si se conoce la función
&lambda; ( t) se puede hallar la ley de distribución de probabilidades de T .
Para calcular la función de distribución de T estudiaremos dos eventos: A := \{T &gt; t\} (el
sistema funciona hasta el momento t) y B := \{t &lt; T &le; t + dt{\} (el sistema sufre una falla en
el intervalo de tiempo (t, t + dt]). Como B &sub; A, tenemos que \mathbb{P}(B) = \mathbb{P}(B &cap; A) y de la regla
del producto se deduce que
\mathbb{P}(B) = \mathbb{P}(B | A)\mathbb{P}(A). (2)
Si la función de distribución de T admite derivada continua, salvo términos de segundo orden
que se pueden despreciar, la probabilidad del evento B se puede expresar en la forma
\mathbb{P}(B) = \mathbb{P}(t &lt; T &le; t + dt) = F
T
(t + dt) − F
T
(t) = F}
′
T
(t)dt. (3)
La probabilidad del evento A se puede expresar en la forma
\mathbb{P}(A) = \mathbb{P}(T &gt; t) = 1 − \mathbb{P}(T &le; t) = 1 − F 
T
(t). (4)
Finalmente, la probabilidad condicional \mathbb{P}(B | A) se expresa mediante la función intensidad de
fallas &lambda;(t):
\mathbb{P}(B | A) = &lambda;(t)dt (5)
Sustituyendo las expresiones (3)-(5) en la fórmula (2) obtenemos, después de dividir ambos
miembros por dt, una ecuación diferencial de primer orden para F}
T
(t)
F
′
T
(t) = &lambda;(t)(1 − F
T
(t)). (6)
Debido a que la duración del servicio del sistema no puede ser negativa, el evento \{T &le; 0{\} es
imposible. En consecuencia, F}
T
(0) = 0. Integrando la ecuación diferencial (6) con la condición
inicial F (0) = 0, obtenemos
2
F
T
(t) = 1 − exp
</p>

<p>
−
Z
t<sub>0</sub>
&lambda; ( s ) ds

. (7)
2
F
′
T
(t) = &lambda;(t)(1 − F
T
(t)) \iff}
F
′
T
(t)
1 − F
T
(t)
= &lambda;(t) \iff}
d
dt
log(1 − F
T
(t)) = − &lambda; (t)
\iff log(1 − F}
T
(t)) = −}
Z
t<sub>0</sub>
&lambda; ( s ) ds + C \iff F
T
(t) = 1 − exp
„
−
Z
t<sub>0</sub>
&lambda; ( s ) ds + C
«
.
Usando que F}
T
(0) = 0 se deduce que C = 0.
4
</p>
</div>
</div>
<div id="outline-container-org14eff89" class="outline-5">
<h5 id="org14eff89">Nota Bene</h5>
<div class="outline-text-5" id="text-org14eff89">
<p>
El desarrollo anterior presupone que la función intensidad de fallas &lambda;(t) verifica}
las siguientes condiciones: (1) &lambda;(t) &ge; 0 para todo t &gt; 0 y (2)
R
&infin;
0
&lambda; ( t ) dt = +{&infin;}.
</p>
</div>
</div>
<div id="outline-container-orgdca0550" class="outline-5">
<h5 id="orgdca0550">Ejemplo 1.3 (Fiabilidad)</h5>
<div class="outline-text-5" id="text-orgdca0550">
<p>
Se estipula que la duración de servicio de un sistema automático}
debe ser t<sub>0</sub>
. Si durante ese período el sistema falla, se lo repara y se lo utiliza hasta que sirva
el plazo estipulado. Sea S el tiempo de funcionamiento del sistema después de la primera
reparación. Quere mos hallar la función de distribución de S}.
En primer lugar observamos que la relación entre la variable aleatoria S y el instante T}
en que ocurre la primera falla del sistema es la siguiente
S = máx(t}
0
− T, 0) =

t<sub>0</sub>
− T si T &le; t<sub>0</sub>
,
0 si T &gt; t}
0
.
Sea F}
S
(s) la función de distribución de la variable S}. Es claro que para s &lt; 0, F}
S
(s) = 0 y
que para s &ge; t}
0
, F}
S
(s) = 1. Lo que falta hacer es analizar el compor
tamiento de F}
S
sobre el
intervalo 0 &le; s &lt; t<sub>0</sub>
. Sea s &isin; [0, t}
0
)
F
S
(s) = \mathbb{P}(S &le; s) = \mathbb{P}(máx(t<sub>0</sub>
− T, 0) &le; s) = \mathbb{P}(t}
0
− T &le; s, 0 &le; s ) 
= \mathbb{P}(t<sub>0</sub>
− T &le; s) = \mathbb{P}(t}
0
− s &le; T ) = exp
</p>

<p>
−
Z
t<sub>0</sub>
−s
0
&lambda; ( t ) dt

,
donde &lambda;(t) es la función intensidad de fallas del sistema.
1
exp
/"
−
R
t<sub>0</sub>
0
&lambda; ( t ) dt
''
t<sub>0</sub>
s{0}
Figura 2: Gráfico de la función de distribución de la variable aleatoria S}.
Por lo tanto,
F
S
(s) = exp
</p>

<p>
−
Z
t<sub>0</sub>
−s
0
&lambda; ( t ) dt

1\{0 &le; s &lt; t<sub>0</sub>
\} + 1} \{s &ge; t<sub>0</sub>
\}.
</p>
</div>
</div>
<div id="outline-container-org68a3f91" class="outline-5">
<h5 id="org68a3f91">Ejercicios adicionales</h5>
<div class="outline-text-5" id="text-org68a3f91">
<ol class="org-ol">
<li>Sea X una variable aleatoria con función de distribución F<sub>X</sub>(x). Mostrar que para cada</li>
</ol>
<p>
pareja de números reales a &lt; b vale que:
\mathbb{P}(a &le; X &le; b) = F
X
(b) − F
X
(a) + \mathbb{P}(X = a) (8)
\mathbb{P}(a &le; X &lt; b) = F
X
(b) − \mathbb{P}(X = b) − F
X
(a) + \mathbb{P}(X = a) (9)
\mathbb{P}(a &lt; X &lt; b) = F
X
(b) − \mathbb{P}(X = b) − F
X
(a) (10)
5
Notar que las fórmulas (8)-(10), junto con (1), muestran como calcular l a probabilidad de
que la variable aleatoria X tome valores en un intervalo de extremos a y b y contienen una
advertencia sobre la acumulación de masa positiva en alguno de los dos extremos.
</p>
</div>
</div>
