org/probabilidad/02_1.org
**** Lema 1.4. 
Sea X : \Omega \rightarrow \Re  una variable aleatoria. La función de distribución de X, F_X(x) =
\mathbb{P}(X \leq x), tiene las siguientes propiedades:}
(F1) es no decreciente{: si x
1
\leq x
2
, entonces F}
X
(x
1
) \leq F
X
(x
2
);
(F2) es continua a derecha{: para todo x
0
\in R vale que lím
x{↓}x
0
F_X(x) = F}
X
(x
0
);
(F3) \lim_{x \rightarrow−\infty}
F_X(x) = 0 y \lim_{x \rightarrow\infty}
F_X(x) = 1.
**** Demostración.
La propiedad (F1) se deduce de la fórmula (1).
La propiedad (F2) es consecuencia del axioma de continuidad de la medida de probabilidad
P. Se considera una sucesión decreciente de números positivos que converge a 0, \epsilon
1
> \epsilon
2
>
dots > 0, arbitraria, pero fija y se definen eventos A}
n
= \{x}
0
< X \leq x
0
+ \epsilon}
n
\. Se observa que}
A_1
\supset A_2
\supset  \cdots  y
T_n{\in{N
A_n
= \emptyset}:
0 = \lim_{n  \rightarrow \infty}
\mathbb{P}(A_n
) = \lim_{n  \rightarrow \infty}
\mathbb{P}(x}
0
< X \leq x
0
+ \epsilon}
n
) = \lim_{n  \rightarrow \infty}
F  ( x
0
+ \epsilon}
n
) − F (x
0
).
Por lo tanto,
F  ( x
0
) = \lim_{n  \rightarrow \infty}
F  ( x
0
+ \epsilon}
n
).
Las propiedades (F3) se demuestran de manera similar.
**** Observación 1.5. 
Si se define
F
X
(x
−
0
) := \lim_x{↑}x
0
F_X(x), 
entonces F}
X
(x
−
0
) = \mathbb{P}(X < x}
0
). Por lo tanto, \mathbb{P}(X = x
0
) = F}
X
(x
0
) − F
X
(x
−
0
). En particular,
si F}
X
(x) es continua en x
0
, entonces \mathbb{P}(X = x
0
) = 0. Si \mathbb{P}(X = x
0
) > 0, entonces F}
X
(x) es
discontinua en x
0
y su discontinuidad es un salto de altura \mathbb{P}(X = x
0
) > 0.
**** Ejercicios adicionales
2. Sea $(\Omega, \mathcal{A},\mathbb{P})$ un espacio de probabilidad y X : \Omega \rightarrow \Re  una variable aleatoria con función}
de distribución F}
X
(x).
(a) Mostrar que
\lim_{x \rightarrow−\infty}
F_X(x) = 0 y \lim_{x \rightarrow\infty}
F_X(x) = 1.
6
(Sugerencia. Considerar sucesiones de eventos B
n
= \{X \leq −n\} y C}
n
= \{X \leq n\, n \in N , y
utilizar el axioma de continuidad de la medida de probabilidad P.)
(b) Mostrar que
\lim_x{↑}x
0
F_X(x) = \mathbb{P}(X < x}
0
).
(Sugerencia. Observar que si x ↑ x 
0
, entonces \{X \leq x\} ↑ \{X < x
0
\} y utilizar el axioma de}
continuidad de la medida de probabilidad P.)
** Clasificación de variables aleatorias
En todo lo que sigue, X designa una variable ale atoria definida sobre un espacio de
probabilidad $(\Omega, \mathcal{A},\mathbb{P})$ y F}
X
(x) := \mathbb{P}(X \leq x) su función de distribución.
**** Nota Bene 
Al observar el gráfico de una función de distribución lo primero que llama la}
atención son sus saltos y sus escalones.
´
Atomos. Diremos que a \in \Re es un átomo de F }
X
(x) si su peso es positivo: \mathbb{P}(X = a) =
F
X
(a) − F
X
(a{−}) > 0.
El conjunto de todos los átomos de F}
X
(x): A = \{a \in \Re : F}
X
(a) − F
X
(a{−}) > 0{\, coincide
con el conjunto de todos los puntos de discontinuidad de F}
X
(x). El peso de cada átomo
coincide con la longitud del salto dado por la función de distribución en dicho átomo. En
consecuencia, existen a lo sumo un átomo de probabilidad >}
1
2
, a lo sumo dos átomos de
probabilidad >}
1
3
, etcétera. Por lo tanto, es posible reordenar los átomos en una sucesión
a
1
, a
2
, \dots tal que \mathbb{P}(X = a
1
) \geq \mathbb{P}(X = a
2
) \geq  \cdots  . En otras palabras, existen a lo sumo}
numerables átomos.
La propiedad de \sigma}-aditividad de la medida de probabilidad P implica que el peso total
del conjunto A no puede exceder la unidad:
P
a{\inA}
\mathbb{P}(X = a) \leq 1.
**** Definición 1.6 (Variables discretas). Diremos que X es una variable aleatoria discreta si 
X
a{\inA}
\mathbb{P}(X = a) = 1.
En tal caso, la función p
X
: A \rightarrow \Re definida por p
X
(x) = \mathbb{P}(X = x) se denomina la función}
de probabilidad de X.
Escalones. Sea X una variable aleatoria discreta. Si a}
1
< a
2
son dos átomos consecutivos,
entonces F}
X
(x) = F}
X
(a
1
) para todo x \in (a
1
, a
2
). En otras palabras, la función de distribución}
de una variable aleatoria discreta debe ser constante entre saltos consecutivos.
Si no lo fuera, deberían existir dos números x
1
< x
2
contenidos en el intervalo (a
1
, a
2
)
tales que F}
X
(x
1
) < F}
X
(x
2
). En tal caso,
\mathbb{P}(X \in A \cup (x
1
, x
2
]) = \mathbb{P}(X \in A}) + \mathbb{P}(x
1
< X \leq x
2
) =
X
a{\inA}
\mathbb{P}(X = a) + F
X
(x
2
) − F
X
(x
1
)
= 1 + F}
X
(x
2
) − F
X
(x
1
) > 1.
lo que constituye un absurdo.
7
**** Definición 1.7 (Variables continuas). Diremos que X es una variable aleatoria continua si 
su función de distribución es continua.
**** Definición 1.8 (Variables mixtas). Diremos que X es una variable aleatoria mixta si no es}
continua ni discreta.
**** Definición 1.9 (Variables absolutamente continuas). Diremos que X es absolutamente con}
tinua si exi ste una función (medible) f}
X
: R \rightarrow R}
+
, llamada densidad de X, tal que cua
lesquiera sean −\infty \leq a < b < \infty vale que
\mathbb{P}(a < X \leq b) =}
Z
b
a
f_X(x) dx. (11)
En particular, para cada x \in \Re}, vale que
F_X(x) = \mathbb{P}(X \leq x) =
Z
x
−\infty
f
X
(t) dt. (12)
**** Nota Bene 
Notar que de (12) se deduce que}
Z
\infty
−\infty
f_X(x)dx = 1.
Aplicando en (12) el teorema Fundamental del Cálculo Integral, se obtiene que si X es abso
lutamente continua, F_X(x) es una función continua para todo x, y su derivada es f_X(x) en
todos los x donde f
X
es continua.
Como la expresión /"absolutamente continua"/es demasiado larga, se suele hablar simple
mente de /"distribuciones continuas''. Sin embargo, hay que tener en cuenta que el hecho de
que F}
X
sea una función continua, no implica que la distribución de X sea absolutamente con}
tinua: hay funciones monótonas y continuas, que sin embargo no son la primitiva de ninguna
función. (Para más detalles consultar el ejemplo sobre distribuciones tipo Cantor que está en
Feller Vol II, p.35-36).
Interpretación intuitiva de la densidad de probabilidad. Sea X una variable aleatoria}
absolutamente continua con función densidad f_X(x) continua. Para cada \epsilon > 0 pequeño y
para x \in \Re vale que
\mathbb{P}(x − \epsilon/}2 < X \leq x + \epsilon/}2) =}
Z
x{+}ε/{2}
x{−}\epsilon/{2}
f
X
(t) dt \approx f}
X
(x)\epsilon.
Dicho en palabras, la probabilidad de que el valor de X se encuentre en un intervalo de
longitud \epsilon centrado en x es aproximadamente f_X(x)\epsilon}.
**** Ejemplos
