probabilidad/02_1.html
<div id="outline-container-org3f84eb8" class="outline-3">
<h3 id="org3f84eb8">Propiedades de la función de distribución</h3>
<div class="outline-text-3" id="text-org3f84eb8">
</div>
<div id="outline-container-org50d228d" class="outline-5">
<h5 id="org50d228d">Lema 1.4.</h5>
<div class="outline-text-5" id="text-org50d228d">
<p>
Sea X : &Omega; &rarr; \Re  una variable aleatoria. La función de distribución de X, F<sub>X</sub>(x) =
\mathbb{P}(X &le; x), tiene las siguientes propiedades:}
(F1) es no decreciente{: si x
1
&le; x
2
, entonces F}
X
(x
1
) &le; F
X
(x
2
);
(F2) es continua a derecha{: para todo x
0
&isin; R vale que lím
x{↓}x
0
F<sub>X</sub>(x) = F}
X
(x
0
);
(F3) lim<sub>x &rarr;−&infin;</sub>
F<sub>X</sub>(x) = 0 y lim<sub>x &rarr;&infin;</sub>
F<sub>X</sub>(x) = 1.
</p>
</div>
</div>
<div id="outline-container-org3db65cf" class="outline-5">
<h5 id="org3db65cf">Demostración.</h5>
<div class="outline-text-5" id="text-org3db65cf">
<p>
La propiedad (F1) se deduce de la fórmula (1).
La propiedad (F2) es consecuencia del axioma de continuidad de la medida de probabilidad
P. Se considera una sucesión decreciente de números positivos que converge a 0, &epsilon;
1
&gt; &epsilon;
2
&gt;
dots &gt; 0, arbitraria, pero fija y se definen eventos A}
n
= \{x}
0
&lt; X &le; x
0
</p>
<ul class="org-ul">
<li>&epsilon;}</li>
</ul>
<p>
n
\. Se observa que}
A<sub>1</sub>
&sup; A<sub>2</sub>
&sup;  &ctdot;  y
T<sub>n</sub>{&isin;{N
A<sub>n</sub>
= &empty;}:
0 = lim<sub>n  &rarr; &infin;</sub>
\mathbb{P}(A<sub>n</sub>
) = lim<sub>n  &rarr; &infin;</sub>
\mathbb{P}(x}
0
&lt; X &le; x
0
</p>
<ul class="org-ul">
<li>&epsilon;}</li>
</ul>
<p>
n
) = lim<sub>n  &rarr; &infin;</sub>
F  ( x
0
</p>
<ul class="org-ul">
<li>&epsilon;}</li>
</ul>
<p>
n
) − F (x
0
).
Por lo tanto,
F  ( x
0
) = lim<sub>n  &rarr; &infin;</sub>
F  ( x
0
</p>
<ul class="org-ul">
<li>&epsilon;}</li>
</ul>
<p>
n
).
Las propiedades (F3) se demuestran de manera similar.
</p>
</div>
</div>
<div id="outline-container-org5d068d3" class="outline-5">
<h5 id="org5d068d3">Observación 1.5.</h5>
<div class="outline-text-5" id="text-org5d068d3">
<p>
Si se define
F
X
(x
−
0
) := lim<sub>x</sub>{↑}x
0
F<sub>X</sub>(x), 
entonces F}
X
(x
−
0
) = \mathbb{P}(X &lt; x}
0
). Por lo tanto, \mathbb{P}(X = x
0
) = F}
X
(x
0
) − F
X
(x
−
0
). En particular,
si F}
X
(x) es continua en x
0
, entonces \mathbb{P}(X = x
0
) = 0. Si \mathbb{P}(X = x
0
) &gt; 0, entonces F}
X
(x) es
discontinua en x
0
y su discontinuidad es un salto de altura \mathbb{P}(X = x
0
) &gt; 0.
</p>
</div>
</div>
<div id="outline-container-orgbaea1c2" class="outline-5">
<h5 id="orgbaea1c2">Ejercicios adicionales</h5>
<div class="outline-text-5" id="text-orgbaea1c2">
<ol class="org-ol">
<li>Sea \((\Omega, \mathcal{A},\mathbb{P})\) un espacio de probabilidad y X : &Omega; &rarr; \Re  una variable aleatoria con función}</li>
</ol>
<p>
de distribución F}
X
(x).
(a) Mostrar que
lim<sub>x &rarr;−&infin;</sub>
F<sub>X</sub>(x) = 0 y lim<sub>x &rarr;&infin;</sub>
F<sub>X</sub>(x) = 1.
6
(Sugerencia. Considerar sucesiones de eventos B
n
= \{X &le; −n\} y C}
n
= \{X &le; n\, n &isin; N , y
utilizar el axioma de continuidad de la medida de probabilidad P.)
(b) Mostrar que
lim<sub>x</sub>{↑}x
0
F<sub>X</sub>(x) = \mathbb{P}(X &lt; x}
0
).
(Sugerencia. Observar que si x ↑ x 
0
, entonces \{X &le; x\} ↑ \{X &lt; x
0
\} y utilizar el axioma de}
continuidad de la medida de probabilidad P.)
</p>
</div>
</div>
</div>
<div id="outline-container-org612ef8c" class="outline-3">
<h3 id="org612ef8c">Clasificación de variables aleatorias</h3>
<div class="outline-text-3" id="text-org612ef8c">
<p>
En todo lo que sigue, X designa una variable ale atoria definida sobre un espacio de
probabilidad \((\Omega, \mathcal{A},\mathbb{P})\) y F}
X
(x) := \mathbb{P}(X &le; x) su función de distribución.
</p>
</div>
<div id="outline-container-orga1b13b1" class="outline-5">
<h5 id="orga1b13b1">Nota Bene</h5>
<div class="outline-text-5" id="text-orga1b13b1">
<p>
Al observar el gráfico de una función de distribución lo primero que llama la}
atención son sus saltos y sus escalones.
´
Atomos. Diremos que a &isin; \Re es un átomo de F }
X
(x) si su peso es positivo: \mathbb{P}(X = a) =
F
X
(a) − F
X
(a{−}) &gt; 0.
El conjunto de todos los átomos de F}
X
(x): A = \{a &isin; \Re : F}
X
(a) − F
X
(a{−}) &gt; 0{\, coincide
con el conjunto de todos los puntos de discontinuidad de F}
X
(x). El peso de cada átomo
coincide con la longitud del salto dado por la función de distribución en dicho átomo. En
consecuencia, existen a lo sumo un átomo de probabilidad &gt;}
1
2
, a lo sumo dos átomos de
probabilidad &gt;}
1
3
, etcétera. Por lo tanto, es posible reordenar los átomos en una sucesión
a
1
, a
2
, &hellip; tal que \mathbb{P}(X = a
1
) &ge; \mathbb{P}(X = a
2
) &ge;  &ctdot;  . En otras palabras, existen a lo sumo}
numerables átomos.
La propiedad de &sigma;}-aditividad de la medida de probabilidad P implica que el peso total
del conjunto A no puede exceder la unidad:
P
a{\inA}
\mathbb{P}(X = a) &le; 1.
</p>
</div>
</div>
<div id="outline-container-orga6bf9f3" class="outline-5">
<h5 id="orga6bf9f3">Definición 1.6 (Variables discretas). Diremos que X es una variable aleatoria discreta si</h5>
<div class="outline-text-5" id="text-orga6bf9f3">
<p>
X
a{\inA}
\mathbb{P}(X = a) = 1.
En tal caso, la función p
X
</p>
<pre class="example">
A \rightarrow \Re definida por p

</pre>
<p>
X
(x) = \mathbb{P}(X = x) se denomina la función}
de probabilidad de X.
Escalones. Sea X una variable aleatoria discreta. Si a}
1
&lt; a
2
son dos átomos consecutivos,
entonces F}
X
(x) = F}
X
(a
1
) para todo x &isin; (a
1
, a
2
). En otras palabras, la función de distribución}
de una variable aleatoria discreta debe ser constante entre saltos consecutivos.
Si no lo fuera, deberían existir dos números x
1
&lt; x
2
contenidos en el intervalo (a
1
, a
2
)
tales que F}
X
(x
1
) &lt; F}
X
(x
2
). En tal caso,
\mathbb{P}(X &isin; A &cup; (x
1
, x
2
]) = \mathbb{P}(X &isin; A}) + \mathbb{P}(x
1
&lt; X &le; x
2
) =
X
a{\inA}
\mathbb{P}(X = a) + F
X
(x
2
) − F
X
(x
1
)
= 1 + F}
X
(x
2
) − F
X
(x
1
) &gt; 1.
lo que constituye un absurdo.
7
</p>
</div>
</div>
<div id="outline-container-org88c44d0" class="outline-5">
<h5 id="org88c44d0">Definición 1.7 (Variables continuas). Diremos que X es una variable aleatoria continua si</h5>
<div class="outline-text-5" id="text-org88c44d0">
<p>
su función de distribución es continua.
</p>
</div>
</div>
<div id="outline-container-org1028f40" class="outline-5">
<h5 id="org1028f40">Definición 1.8 (Variables mixtas). Diremos que X es una variable aleatoria mixta si no es}</h5>
<div class="outline-text-5" id="text-org1028f40">
<p>
continua ni discreta.
</p>
</div>
</div>
<div id="outline-container-org40ccac1" class="outline-5">
<h5 id="org40ccac1">Definición 1.9 (Variables absolutamente continuas). Diremos que X es absolutamente con}</h5>
<div class="outline-text-5" id="text-org40ccac1">
<p>
tinua si exi ste una función (medible) f}
X
</p>
<pre class="example">
R \rightarrow R}

</pre>
<ul class="org-ul">
<li></li>
</ul>
<p>
, llamada densidad de X, tal que cua
lesquiera sean −&infin; &le; a &lt; b &lt; &infin; vale que
\mathbb{P}(a &lt; X &le; b) =}
Z
b
a
f<sub>X</sub>(x) dx. (11)
En particular, para cada x &isin; \Re}, vale que
F<sub>X</sub>(x) = \mathbb{P}(X &le; x) =
Z
x
−&infin;
f
X
(t) dt. (12)
</p>
</div>
</div>
<div id="outline-container-orga8c0e4f" class="outline-5">
<h5 id="orga8c0e4f">Nota Bene</h5>
<div class="outline-text-5" id="text-orga8c0e4f">
<p>
Notar que de (12) se deduce que}
Z
&infin;
−&infin;
f<sub>X</sub>(x)dx = 1.
Aplicando en (12) el teorema Fundamental del Cálculo Integral, se obtiene que si X es abso
lutamente continua, F<sub>X</sub>(x) es una función continua para todo x, y su derivada es f<sub>X</sub>(x) en
todos los x donde f
X
es continua.
Como la expresión /"absolutamente continua"/es demasiado larga, se suele hablar simple
mente de /"distribuciones continuas''. Sin embargo, hay que tener en cuenta que el hecho de
que F}
X
sea una función continua, no implica que la distribución de X sea absolutamente con}
tinua: hay funciones monótonas y continuas, que sin embargo no son la primitiva de ninguna
función. (Para más detalles consultar el ejemplo sobre distribuciones tipo Cantor que está en
Feller Vol II, p.35-36).
Interpretación intuitiva de la densidad de probabilidad. Sea X una variable aleatoria}
absolutamente continua con función densidad f<sub>X</sub>(x) continua. Para cada &epsilon; &gt; 0 pequeño y
para x &isin; \Re vale que
\mathbb{P}(x − &epsilon;/}2 &lt; X &le; x + &epsilon;/}2) =}
Z
x{+}ε/{2}
x{−}&epsilon;/{2}
f
X
(t) dt &asymp; f}
X
(x)&epsilon;.
Dicho en palabras, la probabilidad de que el valor de X se encuentre en un intervalo de
longitud &epsilon; centrado en x es aproximadamente f<sub>X</sub>(x)&epsilon;}.
</p>
</div>
</div>
