org/probabilidad/02_1.org
**** Ejemplo 1.10. 
El resultado, X, del lanzamiento de un dado equilibrado (ver Ejemplo 1.1) 
es}
una variable aleatoria discreta. Esto resulta evidente de observar que el gráfico de la función
de distribución de X (ver Figura 1) que tiene la forma de una escalera con saltos de altura
1 / 6 en los puntos 1, 2, 3, 4, 5, 6. Dicho en otras palabras, toda la masa de la variable aleatoria
X está concentrada en el conjunto de los átomos de F
X
, A = \1, 2, 3, 4, 5, 6{\}.
8
**** Ejemplo 1.11 
(Números al azar). El resultado de /"sortear"/un número al azar sobre el}
intervalo (0, 1) es una variable aleatoria absolutamente continua. La probabilidad del evento
U \leq u es igual a la longitud del intervalo (−\infty, u] \cap (0, 1).
Notar que cuando u \leq 0 el intervalo (−\infty, u] \cap (0, 1) se reduce al conjunto vacío que por
definición tiene longitud 0. Por otra parte, para cualquier u \in (0, 1) se tiene que (−\infty, u] \cap}
(0, 1) = (0, u) y en consecuencia \mathbb{P}(U \leq u
) = u; mientras que si u \geq 1, (−\infty, u]\cap(0, 1) = (0, 1)
de donde sigue que \mathbb{P}(U \leq u) = 1. Por lo tanto, la función de distribución de U es
F
U
(u) = u{1{\}0 \leq u < 1{\} + 1\{u \geq 1{\}.
1
1
u{0}
Figura 3: Gráfico de la función de distribución del resultado de /"sortear"/un número al azar.
Derivando, respecto de u, la función de distribución F}
U
(u) se obtiene una función densidad
para U}:
f
U
(u) = 1{\}0 < u < 1{\}.
**** Nota Bene 
Sortear un número al azar sobre el intervalo (0, 1) es un caso particular de}
una familia de variables aleatorias denominadas uniformes}. Una variable aleatoria X, definida
sobre un espacio de probabilidad (\Omega, \mathcal{A},\mathbb{P}), se denomina uniformemente distribuida sobre el}
intervalo (a, b), donde a < b, si X es absolutamente continua y admite una función densidad}
de la forma
f_X(x) =
1
b − a
1\{x \in (a, b)\}.
En tal caso escribiremos X \sim \mathcal{U} (a, b).
Comentario. En la Sección 1.4 mostraremos que todas las variables aleatorias se pueden}
construir utilizando variables aleatorias uniformemente distribuidas sobre el intervalo (0, 1).
**** Ejemplo 1.12. 
El tiempo, T , de funcionamiento hasta la aparición de la primera falla para}
un sistema con función intensidad de fallas continua \lambda(t) (ver Ejemplo 1.2) 
es una variable
aleatoria absolutamente continua que admite una densidad de la forma
f
T
(t) = \lambda(t) exp

−
Z
t_0
\lambda ( s ) ds

1\{t > 0} \. (13) 
.
9
\hypertarget{pfa}
**** Nota Bene 
algunos casos particulares del Ejemplo 1.12. 
El comportamiento de la}
densidad (13) depende de la forma particular de la función intensidad de fallas \lambda(t). En lo
que sigue mostraremos algunos casos particulares.
Exponencial de intensidad \lambda}. Se obtiene poniendo \lambda(t) = \lambda{1{\}t \geq 0{\, donde \lambda es una}
constante positiva, arbitraria pero fija.
f
T
(t) = \lambda exp (−{\lambda t}) 1\{t > 0{\. (14)
.
Weibull de parámetros c y \alpha}. Se obtiene p
oniendo \lambda(t) =}
c
\alpha

t
\alpha

c{−{1
1\{t \geq 0}\, donde
c > 0 y \alpha > 0. En este caso, la densidad (13) adopta la forma}
f
T
(t) =
c
\alpha

t
\alpha

c{−{1
exp

−

t
\alpha

c

. (15)
0 0.5 1 1.5 2 2.5 3 3.5 4
0
0.2
0.4
0.6
0.8
1
1.2
1.4
1.6
Figura 4: Gráficos de las densidades Weibull de parámetro de escala \alpha = 1 y parámetro de
forma: c = 1, 2, 4: en línea sólida c = 1; en línea quebrada c = 2 y en línea punteada c = 4.
Notar que la exponencial de intensidad \lambda es un caso especial de la Weibull puesto que (14) se
obtiene de (15) poniendo c = 1 y \alpha = \lambda}
−{1}
.
**** Ejemplo 1.13. 
La variable aleatoria, S, considerada en el Ejemplo 1.3 es una variable aleato
ria mixta (ver Figura 2) porque no es discreta ni continua. Tiene un único átomo en s = 0 y
su peso es exp

−
R
t_0
0
\lambda ( x ) dx

.
10
\hypertarget{pfb}
** Cuantiles
**** Definición 1.14. 
Sea \alpha \in (0}, 1)}. Un cuantil}-{\alpha de X es cualquier número x}
\alpha
\in R tal que
\mathbb{P}(X < x
\alpha
) \leq \alpha y \alpha \leq \mathbb{P}(X \leq x}
\alpha
). (16)
**** Observación 1.15. Notar que las desigualdades que caracterizan a los cuantiles-{\alpha se pueden}
reescribir de la siguiente manera
F
X
(x
\alpha
) − \mathbb{P}(X = x
\alpha
) \leq \alpha y \alpha \leq F}
X
(x
\alpha
). (17)
Por lo tanto, si F_X(x) es continua, x}
\alpha
es un cuantil \alpha si y sólo si
F
X
(x
\alpha
) = \alpha. (18)
Interpretación /"geométrica"/del cuantil- \alpha . Si X es una variable aleatoria absoluta
mente continua con función de densidad f_X(x) el cuantil-{\alpha de X es la única solución de la
ecuación
Z
x
\alpha
−\infty
f_X(x)dx = \alpha.
Esto significa que el cuantil-{\alpha de X es el único punto sobre el eje de las abscisas a cuya
izquierda el área bajo la función de densidad f_X(x) es igual a \alpha}.
**** Nota Bene 
Sea x \in \Re} . Las desigualdades (17) significan que x es u n cuantil\alpha si y sólo si 
\alpha \in [ F  ( x) − \mathbb{P}(X = x ) , F  ( x)]
**** Nota Bene 
El cuantil-{\alpha siempre existe. Sea \alpha \in (0, 1), la existencia del cuantil \alpha se deduce}
analizando el conjunto R}
\alpha
X
= \{x \in \Re : \alpha \leq F}
X
(x)\}.
1. R}
\alpha
X
es no vacío porque \lim_{x \rightarrow\infty}
F_X(x) = 1.
2. R}
\alpha
X
es acotado inferiormente porque \lim_{x \rightarrow−\infty}
F_X(x) = 0.
3. Si x
0
\in \Re
\alpha
X
, entonces [x
0
, +{\infty) \subset R
\alpha
X
porque F}
X
(x) es no decreciente.
4. ínf R}
\alpha
X
\in \Re
\alpha
X
porque existe una sucesión \{x}
n
: n \in N\} \subset R}
\alpha
X
tal que x
n
↓ ínf R
\alpha
X
y
F_X(x) es una función continua a derecha:
\alpha \leq lím
{n \rightarrow \infty}
F
X
(x
n
) = F}
X

\lim_{n  \rightarrow \infty}
x
n

= F}
X
(ínf R}
\alpha
X
) .
De las propiedades anteriores se deduce que
R
\alpha
X
= [ínf R}
\alpha
X
, +{\infty) = [mín R
\alpha
X
, +{\infty) .
Hay dos casos posibles: (a) F}
X
(mín R}
\alpha
X
) = \alpha o (b) F}
X
(mín R}
\alpha
X
) > \alpha}.
(a) Si F}
X
(mín R}
\alpha
X
) = \alpha, entonces \mathbb{P}(X < mín R}
\alpha
X
) = \alpha − P}(X = mín R}
\alpha
X
) \leq \alpha} .
11
\hypertarget{pfc}
(b) Si F}
X
(mín R}
\alpha
X
) > \alpha, entonces
\mathbb{P}(X < x) < \alpha \forall x < mín R
\alpha
X
(19)
porque sino existe un x < mín R}
\alpha
x
tal que \alpha \leq P}(X < x) \leq F_X(x) y por lo tanto,
x \in R
\alpha
X
lo que constituye un absurdo.
De (19) se deduce que \mathbb{P}(X < mín R}
\alpha
X
) = \lim_x{↑{mín R 
\alpha
X
F_X(x) \leq \alpha} .
En cualquiera de los dos casos
x
\alpha
= mín \{x \in \Re : F}
X
(x) \geq \alpha\} (20)
es un cuantil- \alpha .
