probabilidad/02_1.html
<div id="outline-container-org3741887" class="outline-5">
<h5 id="org3741887">Ejemplos</h5>
</div>
<div id="outline-container-orgbba2437" class="outline-5">
<h5 id="orgbba2437">Ejemplo 1.10.</h5>
<div class="outline-text-5" id="text-orgbba2437">
<p>
El resultado, X, del lanzamiento de un dado equilibrado (ver Ejemplo 1.1) 
es}
una variable aleatoria discreta. Esto resulta evidente de observar que el gráfico de la función
de distribución de X (ver Figura 1) que tiene la forma de una escalera con saltos de altura
1 / 6 en los puntos 1, 2, 3, 4, 5, 6. Dicho en otras palabras, toda la masa de la variable aleatoria
X está concentrada en el conjunto de los átomos de F
X
, A = \1, 2, 3, 4, 5, 6{\}.
8
</p>
</div>
</div>
<div id="outline-container-org84a1670" class="outline-5">
<h5 id="org84a1670">Ejemplo 1.11</h5>
<div class="outline-text-5" id="text-org84a1670">
<p>
(Números al azar). El resultado de /"sortear"/un número al azar sobre el}
intervalo (0, 1) es una variable aleatoria absolutamente continua. La probabilidad del evento
U &le; u es igual a la longitud del intervalo (−&infin;, u] &cap; (0, 1).
Notar que cuando u &le; 0 el intervalo (−&infin;, u] &cap; (0, 1) se reduce al conjunto vacío que por
definición tiene longitud 0. Por otra parte, para cualquier u &isin; (0, 1) se tiene que (−&infin;, u] &cap;}
(0, 1) = (0, u) y en consecuencia \mathbb{P}(U &le; u
) = u; mientras que si u &ge; 1, (−&infin;, u]&cap;(0, 1) = (0, 1)
de donde sigue que \mathbb{P}(U &le; u) = 1. Por lo tanto, la función de distribución de U es
F
U
(u) = u{1{\}0 &le; u &lt; 1{\} + 1\{u &ge; 1{\}.
1
1
u{0}
Figura 3: Gráfico de la función de distribución del resultado de /"sortear"/un número al azar.
Derivando, respecto de u, la función de distribución F}
U
(u) se obtiene una función densidad
para U}:
f
U
(u) = 1{\}0 &lt; u &lt; 1{\}.
</p>
</div>
</div>
<div id="outline-container-orgc145af0" class="outline-5">
<h5 id="orgc145af0">Nota Bene</h5>
<div class="outline-text-5" id="text-orgc145af0">
<p>
Sortear un número al azar sobre el intervalo (0, 1) es un caso particular de}
una familia de variables aleatorias denominadas uniformes}. Una variable aleatoria X, definida
sobre un espacio de probabilidad (&Omega;, \mathcal{A},\mathbb{P}), se denomina uniformemente distribuida sobre el}
intervalo (a, b), donde a &lt; b, si X es absolutamente continua y admite una función densidad}
de la forma
f<sub>X</sub>(x) =
1
b − a
1\{x &isin; (a, b)\}.
En tal caso escribiremos X &sim; \mathcal{U} (a, b).
Comentario. En la Sección 1.4 mostraremos que todas las variables aleatorias se pueden}
construir utilizando variables aleatorias uniformemente distribuidas sobre el intervalo (0, 1).
</p>
</div>
</div>
<div id="outline-container-org333987c" class="outline-5">
<h5 id="org333987c">Ejemplo 1.12.</h5>
<div class="outline-text-5" id="text-org333987c">
<p>
El tiempo, T , de funcionamiento hasta la aparición de la primera falla para}
un sistema con función intensidad de fallas continua &lambda;(t) (ver Ejemplo 1.2) 
es una variable
aleatoria absolutamente continua que admite una densidad de la forma
f
T
(t) = &lambda;(t) exp
</p>

<p>
−
Z
t<sub>0</sub>
&lambda; ( s ) ds

1\{t &gt; 0} \. (13) 
.
9
\hypertarget{pfa}
</p>
</div>
</div>
<div id="outline-container-orgb092afa" class="outline-5">
<h5 id="orgb092afa">Nota Bene</h5>
<div class="outline-text-5" id="text-orgb092afa">
<p>
algunos casos particulares del Ejemplo 1.12. 
El comportamiento de la}
densidad (13) depende de la forma particular de la función intensidad de fallas &lambda;(t). En lo
que sigue mostraremos algunos casos particulares.
Exponencial de intensidad &lambda;}. Se obtiene poniendo &lambda;(t) = &lambda;{1{\}t &ge; 0{\, donde &lambda; es una}
constante positiva, arbitraria pero fija.
f
T
(t) = &lambda; exp (−{&lambda; t}) 1\{t &gt; 0{\. (14)
.
Weibull de parámetros c y &alpha;}. Se obtiene p
oniendo &lambda;(t) =}
c
&alpha;

t
&alpha;

c{−{1
1\{t &ge; 0}\, donde
c &gt; 0 y &alpha; &gt; 0. En este caso, la densidad (13) adopta la forma}
f
T
(t) =
c
&alpha;
</p>

<p>
t
&alpha;

c{−{1
exp
</p>

<p>
−
</p>

<p>
t
&alpha;

c

. (15)
0 0.5 1 1.5 2 2.5 3 3.5 4
0
0.2
0.4
0.6
0.8
1
1.2
1.4
1.6
Figura 4: Gráficos de las densidades Weibull de parámetro de escala &alpha; = 1 y parámetro de
forma: c = 1, 2, 4: en línea sólida c = 1; en línea quebrada c = 2 y en línea punteada c = 4.
Notar que la exponencial de intensidad &lambda; es un caso especial de la Weibull puesto que (14) se
obtiene de (15) poniendo c = 1 y &alpha; = &lambda;}
−{1}
.
</p>
</div>
</div>
<div id="outline-container-orgc653a5f" class="outline-5">
<h5 id="orgc653a5f">Ejemplo 1.13.</h5>
<div class="outline-text-5" id="text-orgc653a5f">
<p>
La variable aleatoria, S, considerada en el Ejemplo 1.3 es una variable aleato
ria mixta (ver Figura 2) porque no es discreta ni continua. Tiene un único átomo en s = 0 y
su peso es exp

−
R
t<sub>0</sub>
0
&lambda; ( x ) dx

.
10
\hypertarget{pfb}
</p>
</div>
</div>
</div>
<div id="outline-container-orgf6ec5e5" class="outline-3">
<h3 id="orgf6ec5e5">Cuantiles</h3>
<div class="outline-text-3" id="text-orgf6ec5e5">
</div>
<div id="outline-container-orgad95fde" class="outline-5">
<h5 id="orgad95fde">Definición 1.14.</h5>
<div class="outline-text-5" id="text-orgad95fde">
<p>
Sea &alpha; &isin; (0}, 1)}. Un cuantil}-{&alpha; de X es cualquier número x}
&alpha;
&isin; R tal que
\mathbb{P}(X &lt; x
&alpha;
) &le; &alpha; y &alpha; &le; \mathbb{P}(X &le; x}
&alpha;
). (16)
</p>
</div>
</div>
<div id="outline-container-orgc300791" class="outline-5">
<h5 id="orgc300791">Observación 1.15. Notar que las desigualdades que caracterizan a los cuantiles-{&alpha; se pueden}</h5>
<div class="outline-text-5" id="text-orgc300791">
<p>
reescribir de la siguiente manera
F
X
(x
&alpha;
) − \mathbb{P}(X = x
&alpha;
) &le; &alpha; y &alpha; &le; F}
X
(x
&alpha;
). (17)
Por lo tanto, si F<sub>X</sub>(x) es continua, x}
&alpha;
es un cuantil &alpha; si y sólo si
F
X
(x
&alpha;
) = &alpha;. (18)
Interpretación /"geométrica"/del cuantil- &alpha; . Si X es una variable aleatoria absoluta
mente continua con función de densidad f<sub>X</sub>(x) el cuantil-{&alpha; de X es la única solución de la
ecuación
Z
x
&alpha;
−&infin;
f<sub>X</sub>(x)dx = &alpha;.
Esto significa que el cuantil-{&alpha; de X es el único punto sobre el eje de las abscisas a cuya
izquierda el área bajo la función de densidad f<sub>X</sub>(x) es igual a &alpha;}.
</p>
</div>
</div>
<div id="outline-container-orgdc911ce" class="outline-5">
<h5 id="orgdc911ce">Nota Bene</h5>
<div class="outline-text-5" id="text-orgdc911ce">
<p>
Sea x &isin; \Re} . Las desigualdades (17) significan que x es u n cuantil&alpha; si y sólo si 
&alpha; &isin; [ F  ( x) − \mathbb{P}(X = x ) , F  ( x)]
</p>
</div>
</div>
<div id="outline-container-org1c89f35" class="outline-5">
<h5 id="org1c89f35">Nota Bene</h5>
<div class="outline-text-5" id="text-org1c89f35">
<p>
El cuantil-{&alpha; siempre existe. Sea &alpha; &isin; (0, 1), la existencia del cuantil &alpha; se deduce}
analizando el conjunto R}
&alpha;
X
= \{x &isin; \Re : &alpha; &le; F}
X
(x)\}.
</p>
<ol class="org-ol">
<li>R}</li>
</ol>
<p>
&alpha;
X
es no vacío porque lim<sub>x &rarr;&infin;</sub>
F<sub>X</sub>(x) = 1.
</p>
<ol class="org-ol">
<li>R}</li>
</ol>
<p>
&alpha;
X
es acotado inferiormente porque lim<sub>x &rarr;−&infin;</sub>
F<sub>X</sub>(x) = 0.
</p>
<ol class="org-ol">
<li>Si x</li>
</ol>
<p>
0
&isin; \Re
&alpha;
X
, entonces [x
0
, +{&infin;) &sub; R
&alpha;
X
porque F}
X
(x) es no decreciente.
</p>
<ol class="org-ol">
<li>ínf R}</li>
</ol>
<p>
&alpha;
X
&isin; \Re
&alpha;
X
porque existe una sucesión \{x}
n
</p>
<pre class="example">
n \in N\} \subset R}

</pre>
<p>
&alpha;
X
tal que x
n
↓ ínf R
&alpha;
X
y
F<sub>X</sub>(x) es una función continua a derecha:
&alpha; &le; lím
{n &rarr; &infin;}
F
X
(x
n
) = F}
X

lim<sub>n  &rarr; &infin;</sub>
x
n

= F}
X
(ínf R}
&alpha;
X
) .
De las propiedades anteriores se deduce que
R
&alpha;
X
= [ínf R}
&alpha;
X
, +{&infin;) = [mín R
&alpha;
X
, +{&infin;) .
Hay dos casos posibles: (a) F}
X
(mín R}
&alpha;
X
) = &alpha; o (b) F}
X
(mín R}
&alpha;
X
) &gt; &alpha;}.
(a) Si F}
X
(mín R}
&alpha;
X
) = &alpha;, entonces \mathbb{P}(X &lt; mín R}
&alpha;
X
) = &alpha; − P}(X = mín R}
&alpha;
X
) &le; &alpha;} .
11
\hypertarget{pfc}
(b) Si F}
X
(mín R}
&alpha;
X
) &gt; &alpha;, entonces
\mathbb{P}(X &lt; x) &lt; &alpha; &forall; x &lt; mín R
&alpha;
X
(19)
porque sino existe un x &lt; mín R}
&alpha;
x
tal que &alpha; &le; P}(X &lt; x) &le; F<sub>X</sub>(x) y por lo tanto,
x &isin; R
&alpha;
X
lo que constituye un absurdo.
De (19) se deduce que \mathbb{P}(X &lt; mín R}
&alpha;
X
) = lim<sub>x</sub>{↑{mín R 
&alpha;
X
F<sub>X</sub>(x) &le; &alpha;} .
En cualquiera de los dos casos
x
&alpha;
= mín \{x &isin; \Re : F}
X
(x) &ge; &alpha;\} (20)
es un cuantil- &alpha; .
</p>
</div>
</div>
