org/probabilidad/02_1.org
**** Nota Bene 
Si F
X
es discontinua, (18) no tiene siempre solución; y por eso es mejor tomar
(16) como definición. Si F}
X
es estrictamente creciente, los cuantiles son únicos. Pero si no,
los valores que satisfacen (18) forman un intervalo.
Cuartiles y mediana. Los cuantiles correspondientes a \alpha = 0.25, 0.50 y 0.75 son respecti
vamente el primer, el segundo y tercer cuartil}. El segundo cuartil es la mediana.
**** Ejemplos
**** Ejemplo 1.16. 
En el Ejemplo 1.1 hemos visto que la función de distribución del resultado}
del lanzamie nto de un dado equilibrado e s una escalera con saltos de altura 1 / 6 en los puntos
1, 2, 3, 4, 5, 6:
F_X(x) =
5
X
{i=1}
i
6
1 \{i \leq x < i + 1}\} + 1\{6 \leq x\}.
Como la i magen de F}
X
es el conjunto \0, 1 / 6, 2 / 6, 3 / 6, 4 / 6, 5 / 6, 1{\} la ecuación (18) solo tiene
solución para \alpha \in \}1 / 6, 2 / 6, 3 / 6, 4 / 6, 5 / 6{\}. Más aún, para cada i = 1, \dots , 5
F_X(x) =
i
6
\iff x \in [i, i + 1).
En otras palabras, para cada i = 1, \dots , 5 los cuantiles-{i/}6 de X son el intervalo [i, i + 1). En
particular, /"la"/mediana de X es cualquier punto del intervalo [3, 4).
Para cada \alpha \in

{i-1}
6
,
i
6

, i = 1, \dots , 6, el cuantil \alpha de X es x
\alpha
= i.
**** Ejemplo 1.17. 
Sea T el tiempo de funcionamiento hasta la aparición de la primera falla para}
un sistema con función intensidad de fallas \lambda(t) = 2{t{1{\}t \geq 0{\} (ver Ejemplo 1.2). La función
de distribución de T es
F
T
(t) =

1 − exp

−
Z
t_0
2{sds}

1\{t > 0}\} =

1 − exp

−t
2

1\{t > 0} \. (21) 
Como F}
T
(t) es continua los cuantiles- \alpha , \alpha \in (0, 1), se obtienen resolviendo la ecuación (18):
F
T
(t) = \alpha \iff 1 − exp 

−t
2

= \alpha \iff t = }
p
− log(1 − \alpha ) .
Por lo tanto, para cada \alpha \in (0, 1) el cuantil-{\alpha de T es
t
\alpha
=
p
− log(1 − \alpha ) . (22)}
En particular, la mediana de T es t_0.5
=
p
− log(1 − 0.5) \approx 0.8325.
12
\hypertarget{pfd}
**** Ejemplo 1.18. 
Se considera un sistema con función intensidad de fallas \lambda(t) = 2{t{1{\}t \geq 0{\}.
El sistema debe prestar ser vici os durante 1 hora. Si durante ese período el sistema falla, se lo
repara y se lo vuelve a utiliza hasta que cumpla con el el plazo estipulado. Sea S el tiempo
de funcionamiento (medido en horas) del sistema después de la primera reparación.
En el Ejemplo 1.3 vimos que la función de distribución de S es
F
S
(s) = exp

−
Z
1{−s}
0
2{tdt}

1\{0 \leq s < 1}\} + 1\{s \geq 1\}
= exp

−(1 − s ) 
2

1\{0 \leq s < 1}\} + 1\{s \geq 1}\, 
y que S es una variable aleatoria mixta (ver Figura 2) con un único átomo en s = 0 cuyo
peso es e
−{1}
. En consecuencia, s = 0 es un cuantil-{\alpha de S para todo \alpha \in

0, e}
−{1}

. Restringida
al intervalo (0, 1) la función F}
S
(s) es continua y su imagen es el intervalo (e
−{1}
, 1). Por ende,}
para cada \alpha \in (e
−{1}
, 1) el cuantil\alpha de S se obtiene resolviendo la ecuación F
S
(s) = \alpha}:
F
S
(s) = \alpha \iff exp 

−(1 − s ) 
2

= \alpha \iff −(1 − s ) 
2
= log( \alpha )
\iff (1 − s ) 
2
= − log( \alpha ) \iff |{1 − s| =
p
− log( \alpha )
\iff 1 − s =
p
− log( \alpha ) \iff 1 −
p
− log( \alpha ) = s.}
Por lo tanto, para cada \alpha \in (e
−{1}
, 1) el cuantil\alpha de S es}
s
\alpha
= 1 −}
p
− log( \alpha ).
En particular, la mediana de S e s s
0.5
= 1 −}
p
− log(0.5) \approx 0.1674.
** Construcción de variables aleatorias
**** Teorema 1.19 (Simulación). Sea F : R \rightarrow [0, 1] una función con las siguientes propiedades}
(F1) es no decreciente{: si x
1
\leq x
2
, entonces F (x
1
) \leq F (x
2
);
(F2) es continua a derecha{: para todo x
0
\in R vale que lím
x{↓}x
0
F  ( x) = F  ( x
0
);
(F3) \lim_{x \rightarrow−\infty}
F  ( x) = 0 y lím}
{x\rightarrow\infty}
F  ( x) = 1.
Existe una variable aleatoria X tal que F (x) = \mathbb{P}(X \leq x).
Esquema de la demostración.
1
o
) Definir la inversa generalizada de F mediante
F
−{1}
(u) := mín\{x \in \Re : u \leq F (x)\, u \in (0, 1).
2
o
) Definir X mediante
X := F
−{1}
(U), donde U \sim \mathcal{U} (0, 1).
3
o
) Observar que vale la equivalencia (inmediata) F}
−{1}
(u) \leq x ⇔ u \leq F (x) y deducir que
\mathbb{P}(X \leq x) = \mathbb{P}(F
−{1}
(U) \leq x) = \mathbb{P}(U \leq F (x)) = F (x).
**** Observación 1.20. Si la función F del enunciado del Teorema 1.19 es continua, la inversa}
generalizada es simplemente la inversa.
13
\hypertarget{pfe}
**** Nota Bene 
El esquema de la demostración del Teorema 1.19 muestra cómo se construye
una va riab le aleatoria X con función de distribución F}
X
(x). La construcción es clave para sim
ular variables aleatorias en una computadora: algoritmos estándar generan variables aleatorias
U con distribución uniforme sobre el intervalo (0, 1), aplicando la inversa generalizada de la}
función de distribución se obtiene la variable aleatoria F}
−{1}
X
(U) cuya función de distribución
es F}
X
(x).
Método gráfico para calcular inversas generalizadas. Sea u \in (0, 1), por definición,}
F
−{1}
(u) := mín\{x \in \Re : u \leq F (x)\, 0 < u < 1. Gráficamente esto significa que para calcular
F
−{1}
(u) hay que determinar el conjunto de to dos los puntos del gráfico de F (x) que están
sobre o por encima de la recta horizontal de altura u y proyectarlo sobre el eje de las abscisas.
El resultado de la proyección es una semi-recta sobre el eje de las abscisas y el valor de la
abscisa que la cierra por izquierda es el valor de F}
−{1}
(u).
**** Ejemplo 1.21 
(Moneda cargada). Se quiere simular el lanzamiento de una moneda /"cargada''}
con probabilidad p \in (0}, 1) de salir cara. El problema se resuelve construyendo una variable}
aleatoria X a valores \0, 1{\} tal que \mathbb{P}(X = 1) = p y \mathbb{P}(X = 0) = 1 − p, (X = 1 representa el
evento /"la moneda sale cara"/y X = 0 /"la moneda sale c eca''). La función de distribución de
X debe ser F  ( x) = (1 − p)1{\}0 \leq x < 1{\} + 1{\}x \geq 1\} y su gráfico se muestra en la Figura 5.}
u
1 x
1 − p}
p
1
0
Figura 5: Gráfico de la función F (x) = (1 − p)1{\}0 \leq x < 1{\} + 1\{x \geq 1{\}.
La demostración del Teorema 1.19 indica que para construir la variable aleatoria X lo
primero que hay que hacer es determinar la expresión de la inversa generalizada de F (x).
Para ello usaremos el método gráfico.
En la Figura 5 se puede ver que para cada 0 < u \leq 1 − p el conjunto \{x \in \Re : u \leq F (x)\}
es la semi-recta [0, \infty}) y el punto que la cierra por izquierda es x = 0. En consecuencia
F
−{1}
(u) = 0 para todo 0 < u \leq 1 − p}. Del mismo modo se puede ver que F}
−{1}
(u) = 1 para
todo 1 − p < u < 1. Por lo tanto, F}
−{1}
(u) = 1{\}1 − p < u < 1{\}.
Definiendo X := 1{\}1 − p < U < 1{\, donde U \sim \mathcal{U} (0, 1) se obtiene la variable aleatoria
deseada.
