probabilidad/02_1.html
<div id="outline-container-orgef810b8" class="outline-5">
<h5 id="orgef810b8">Nota Bene</h5>
<div class="outline-text-5" id="text-orgef810b8">
<p>
Si F
X
es discontinua, (18) no tiene siempre solución; y por eso es mejor tomar
(16) como definición. Si F}
X
es estrictamente creciente, los cuantiles son únicos. Pero si no,
los valores que satisfacen (18) forman un intervalo.
Cuartiles y mediana. Los cuantiles correspondientes a &alpha; = 0.25, 0.50 y 0.75 son respecti
vamente el primer, el segundo y tercer cuartil}. El segundo cuartil es la mediana.
</p>
</div>
</div>
<div id="outline-container-org24c2cee" class="outline-5">
<h5 id="org24c2cee">Ejemplos</h5>
</div>
<div id="outline-container-org0e718e1" class="outline-5">
<h5 id="org0e718e1">Ejemplo 1.16.</h5>
<div class="outline-text-5" id="text-org0e718e1">
<p>
En el Ejemplo 1.1 hemos visto que la función de distribución del resultado}
del lanzamie nto de un dado equilibrado e s una escalera con saltos de altura 1 / 6 en los puntos
1, 2, 3, 4, 5, 6:
F<sub>X</sub>(x) =
5
X
{i=1}
i
6
1 \{i &le; x &lt; i + 1}\} + 1\{6 &le; x\}.
Como la i magen de F}
X
es el conjunto \0, 1 / 6, 2 / 6, 3 / 6, 4 / 6, 5 / 6, 1{\} la ecuación (18) solo tiene
solución para &alpha; &isin; \}1 / 6, 2 / 6, 3 / 6, 4 / 6, 5 / 6{\}. Más aún, para cada i = 1, &hellip; , 5
F<sub>X</sub>(x) =
i
6
\iff x &isin; [i, i + 1).
En otras palabras, para cada i = 1, &hellip; , 5 los cuantiles-{i/}6 de X son el intervalo [i, i + 1). En
particular, /"la"/mediana de X es cualquier punto del intervalo [3, 4).
Para cada &alpha; &isin;

{i-1}
6
,
i
6

, i = 1, &hellip; , 6, el cuantil &alpha; de X es x
&alpha;
= i.
</p>
</div>
</div>
<div id="outline-container-org592f0d0" class="outline-5">
<h5 id="org592f0d0">Ejemplo 1.17.</h5>
<div class="outline-text-5" id="text-org592f0d0">
<p>
Sea T el tiempo de funcionamiento hasta la aparición de la primera falla para}
un sistema con función intensidad de fallas &lambda;(t) = 2{t{1{\}t &ge; 0{\} (ver Ejemplo 1.2). La función
de distribución de T es
F
T
(t) =
</p>

<p>
1 − exp
</p>

<p>
−
Z
t<sub>0</sub>
2{sds}

1\{t &gt; 0}\} =

1 − exp

−t
2

1\{t &gt; 0} \. (21) 
Como F}
T
(t) es continua los cuantiles- &alpha; , &alpha; &isin; (0, 1), se obtienen resolviendo la ecuación (18):
F
T
(t) = &alpha; \iff 1 − exp 

−t
2

= &alpha; \iff t = }
p
− log(1 − &alpha; ) .
Por lo tanto, para cada &alpha; &isin; (0, 1) el cuantil-{&alpha; de T es
t
&alpha;
=
p
− log(1 − &alpha; ) . (22)}
En particular, la mediana de T es t<sub>0.5</sub>
=
p
− log(1 − 0.5) &asymp; 0.8325.
12
\hypertarget{pfd}
</p>
</div>
</div>
<div id="outline-container-org810297b" class="outline-5">
<h5 id="org810297b">Ejemplo 1.18.</h5>
<div class="outline-text-5" id="text-org810297b">
<p>
Se considera un sistema con función intensidad de fallas &lambda;(t) = 2{t{1{\}t &ge; 0{\}.
El sistema debe prestar ser vici os durante 1 hora. Si durante ese período el sistema falla, se lo
repara y se lo vuelve a utiliza hasta que cumpla con el el plazo estipulado. Sea S el tiempo
de funcionamiento (medido en horas) del sistema después de la primera reparación.
En el Ejemplo 1.3 vimos que la función de distribución de S es
F
S
(s) = exp
</p>

<p>
−
Z
1{−s}
0
2{tdt}

1\{0 &le; s &lt; 1}\} + 1\{s &ge; 1\}
= exp

−(1 − s ) 
2

1\{0 &le; s &lt; 1}\} + 1\{s &ge; 1}\, 
y que S es una variable aleatoria mixta (ver Figura 2) con un único átomo en s = 0 cuyo
peso es e
−{1}
. En consecuencia, s = 0 es un cuantil-{&alpha; de S para todo &alpha; &isin;

0, e}
−{1}

. Restringida
al intervalo (0, 1) la función F}
S
(s) es continua y su imagen es el intervalo (e
−{1}
, 1). Por ende,}
para cada &alpha; &isin; (e
−{1}
, 1) el cuantil&alpha; de S se obtiene resolviendo la ecuación F
S
(s) = &alpha;}:
F
S
(s) = &alpha; \iff exp 

−(1 − s ) 
2

= &alpha; \iff −(1 − s ) 
2
= log( &alpha; )
\iff (1 − s ) 
2
= − log( &alpha; ) \iff |{1 − s| =
p
− log( &alpha; )
\iff 1 − s =
p
− log( &alpha; ) \iff 1 −
p
− log( &alpha; ) = s.}
Por lo tanto, para cada &alpha; &isin; (e
−{1}
, 1) el cuantil&alpha; de S es}
s
&alpha;
= 1 −}
p
− log( &alpha; ).
En particular, la mediana de S e s s
0.5
= 1 −}
p
− log(0.5) &asymp; 0.1674.
</p>
</div>
</div>
</div>
<div id="outline-container-org00c2926" class="outline-3">
<h3 id="org00c2926">Construcción de variables aleatorias</h3>
<div class="outline-text-3" id="text-org00c2926">
</div>
<div id="outline-container-orgd1fc471" class="outline-5">
<h5 id="orgd1fc471">Teorema 1.19 (Simulación). Sea F : R &rarr; [0, 1] una función con las siguientes propiedades}</h5>
<div class="outline-text-5" id="text-orgd1fc471">
<p>
(F1) es no decreciente{: si x
1
&le; x
2
, entonces F (x
1
) &le; F (x
2
);
(F2) es continua a derecha{: para todo x
0
&isin; R vale que lím
x{↓}x
0
F  ( x) = F  ( x
0
);
(F3) lim<sub>x &rarr;−&infin;</sub>
F  ( x) = 0 y lím}
{x&rarr;&infin;}
F  ( x) = 1.
Existe una variable aleatoria X tal que F (x) = \mathbb{P}(X &le; x).
Esquema de la demostración.
1
o
) Definir la inversa generalizada de F mediante
F
−{1}
(u) := mín\{x &isin; \Re : u &le; F (x)\, u &isin; (0, 1).
2
o
) Definir X mediante
X := F
−{1}
(U), donde U &sim; \mathcal{U} (0, 1).
3
o
) Observar que vale la equivalencia (inmediata) F}
−{1}
(u) &le; x ⇔ u &le; F (x) y deducir que
\mathbb{P}(X &le; x) = \mathbb{P}(F
−{1}
(U) &le; x) = \mathbb{P}(U &le; F (x)) = F (x).
</p>
</div>
</div>
<div id="outline-container-org9d59fa2" class="outline-5">
<h5 id="org9d59fa2">Observación 1.20. Si la función F del enunciado del Teorema 1.19 es continua, la inversa}</h5>
<div class="outline-text-5" id="text-org9d59fa2">
<p>
generalizada es simplemente la inversa.
13
\hypertarget{pfe}
</p>
</div>
</div>
<div id="outline-container-org2c9e469" class="outline-5">
<h5 id="org2c9e469">Nota Bene</h5>
<div class="outline-text-5" id="text-org2c9e469">
<p>
El esquema de la demostración del Teorema 1.19 muestra cómo se construye
una va riab le aleatoria X con función de distribución F}
X
(x). La construcción es clave para sim
ular variables aleatorias en una computadora: algoritmos estándar generan variables aleatorias
U con distribución uniforme sobre el intervalo (0, 1), aplicando la inversa generalizada de la}
función de distribución se obtiene la variable aleatoria F}
−{1}
X
(U) cuya función de distribución
es F}
X
(x).
Método gráfico para calcular inversas generalizadas. Sea u &isin; (0, 1), por definición,}
F
−{1}
(u) := mín\{x &isin; \Re : u &le; F (x)\, 0 &lt; u &lt; 1. Gráficamente esto significa que para calcular
F
−{1}
(u) hay que determinar el conjunto de to dos los puntos del gráfico de F (x) que están
sobre o por encima de la recta horizontal de altura u y proyectarlo sobre el eje de las abscisas.
El resultado de la proyección es una semi-recta sobre el eje de las abscisas y el valor de la
abscisa que la cierra por izquierda es el valor de F}
−{1}
(u).
</p>
</div>
</div>
<div id="outline-container-orge1f7f9e" class="outline-5">
<h5 id="orge1f7f9e">Ejemplo 1.21</h5>
<div class="outline-text-5" id="text-orge1f7f9e">
<p>
(Moneda cargada). Se quiere simular el lanzamiento de una moneda /"cargada''}
con probabilidad p &isin; (0}, 1) de salir cara. El problema se resuelve construyendo una variable}
aleatoria X a valores \0, 1{\} tal que \mathbb{P}(X = 1) = p y \mathbb{P}(X = 0) = 1 − p, (X = 1 representa el
evento /"la moneda sale cara"/y X = 0 /"la moneda sale c eca''). La función de distribución de
X debe ser F  ( x) = (1 − p)1{\}0 &le; x &lt; 1{\} + 1{\}x &ge; 1\} y su gráfico se muestra en la Figura 5.}
u
1 x
1 − p}
p
1
0
Figura 5: Gráfico de la función F (x) = (1 − p)1{\}0 &le; x &lt; 1{\} + 1\{x &ge; 1{\}.
La demostración del Teorema 1.19 indica que para construir la variable aleatoria X lo
primero que hay que hacer es determinar la expresión de la inversa generalizada de F (x).
Para ello usaremos el método gráfico.
En la Figura 5 se puede ver que para cada 0 &lt; u &le; 1 − p el conjunto \{x &isin; \Re : u &le; F (x)\}
es la semi-recta [0, &infin;}) y el punto que la cierra por izquierda es x = 0. En consecuencia
F
−{1}
(u) = 0 para todo 0 &lt; u &le; 1 − p}. Del mismo modo se puede ver que F}
−{1}
(u) = 1 para
todo 1 − p &lt; u &lt; 1. Por lo tanto, F}
−{1}
(u) = 1{\}1 − p &lt; u &lt; 1{\}.
Definiendo X := 1{\}1 − p &lt; U &lt; 1{\, donde U &sim; \mathcal{U} (0, 1) se obtiene la variable aleatoria
deseada.
</p>
</div>
</div>
