probabilidad/02_1.html
<div id="outline-container-org3a36d3e" class="outline-5">
<h5 id="org3a36d3e">Ejemplo 1.22</h5>
<div class="outline-text-5" id="text-org3a36d3e">
<p>
(Moneda cargada). Simular diez lanzamientos de una moneda /"cargada"/con}
probabilidad 0.6 de salir cara en cada lanzamiento.
De acuerdo con el resultado obtenido en el Ejemplo 1.21, 
para simular el lanzamiento
de una moneda cargada con probabilidad 0.6 de salir cara se construye la variable aleatoria
X := 1{\}0.4 &lt; U &lt; 1{\, donde U &sim; U(0 , 1).
14
\hypertarget{pff}
Para simular 10 valores de X se simulan 10 valores de U}. Si en 10 simulaciones de U}
se obtuviesen los valores 0.578, 0.295, 0.885, 0.726, 0.548, 0.048, 0.474, 0.722, 0.786, 0.598,
los valores de la variable X serían 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, respectivamente, y en tal caso, los
resultados de los 10 lanzamientos de la moneda serían H, T, H, H, H, T, H, H, H, H}.
</p>
</div>
</div>
<div id="outline-container-orgeea308d" class="outline-5">
<h5 id="orgeea308d">Ejemplo 1.23</h5>
<div class="outline-text-5" id="text-orgeea308d">
<p>
(Fiabilidad). Se considera un sistema electrónico con función intensidad de}
fallas de la forma &lambda; ( t) = 2}t{1{\}t &gt; 0{\ . Se quiere estimar la función de probabilidad de la
cantidad de fallas ocurridas durante la primer unidad de tiempo de funcionamiento.
Para simplificar el problema vamos a suponer que cada vez que se produce una falla, el
sistema se repara instantáneamente renovándose sus condiciones iniciales de funcionamien
to. Según el Ejemplo 1.2, 
la función de distribución del tiempo de funcionamiento hasta la
aparición de la primer falla es
F  ( t) =}

1 − exp

−t
2

1\{t &gt; 0} \. (23) 
Debido a que la función de distribución F (t) es continua, su inversa generalizada es simple
mente su inversa y se obtiene despejando t de la ecuación 1 −}exp

−t
2

= u. En consecuencia,
F
−{1}
(u) =
p
− log(1 − u), u &isin; (0, 1). Para construir la variable T usamos un número aleatorio}
U, uniformemente distribuido sobre el intervalo (0, 1) y definimos}
T := F
−{1}
(U) =
p
− log(1 − U ) . (24)}
La ventaja de la construcción es que puede implementarse casi de inmediato en una computa
dora. Por ejemplo, una rutina en Octave para simular T es la siguiente
U=rand;
T=sqrt(-log(1-rand))
Sobre la base de esa rutina podemos simular valores de T . Por ejemplo, en diez simulaciones
de T obtuvimos los valores siguientes: 0.3577, 1.7233, 1.1623, 0.3988, 1.4417, 0.3052, 1.1532,
0.3875, 0.8493, 0.9888.
t<sub>10</sub> 2 3 4 5 6 7 8 9
Figura 6: Simulación de los tiempos de ocurrencia de las fallas de un sistema electrónico con
función intensidad de fallas de la forma &lambda;(t) = 2{t{1{\}t &ge; 0{\}. Las fallas ocurren los instantes
0.3577, 2.0811, 3.2434, 3.6422, 5.0839, 5.3892, 6.5423, 6.9298, 7.7791, 8.7679.
La rutina puede utilizarse para simular cien mil realizaciones del experimento que consiste
en observar la cantidad de fallas durante la primer unidad de tiempo de funcionamiento
del sistema electrónico bajo consideración: N[0, 1] := mín \{n &ge; 1 :
P
n
{i=1}
T
i
&gt; 1{\} − 1, donde}
T<sub>1</sub>
, T<sub>2</sub>
, &hellip; son realizaciones independientes de los tiempos de funcionamiento del sistema hasta}
la ocurrencia de una falla.
Por ejemplo, repitiendo la simulación 100000 veces obtuvimos la siguiente tabla que con
tiene la cantidad de veces que fué simulado cada valor de la variable N[0, 1]:
valor simulado 0 1 2 3 4
frecuencia 36995 51792 10438 743 32
(25)
15
obteniéndose las siguientes estimaciones
\mathbb{P}(N[0, 1] = 0) &asymp; 0.36995, \mathbb{P}(N[0, 1] = 1) &asymp; 0.51792, \mathbb{P}(N[0, 1] = 2) &asymp; 0.10438, 
\mathbb{P}(N[0, 1] = 3) &asymp; 0.00743, \mathbb{P}(N[0, 1] = 4) &asymp; 0.00032.
Para finalizar este ejemplo, presentamos una rutina en Octave que simula cien mil veces
la cantidad de fallas en la primer unidad de tiempo y que al final produce los resultados para
construir una tabla similar a la tabla (25).
for i=1:100000
n=-1;
S=0;
while S&lt;=1;
T=sqrt(-log(1-rand));
S=S+T;
n=n+1;
end
f(i)=n;
end
M=max(f);
for i=1:M+1;
N(i)=length(find(f==i-1));
end
N
</p>
</div>
</div>
<div id="outline-container-org58d5c9c" class="outline-5">
<h5 id="org58d5c9c">Ejemplo 1.24</h5>
<div class="outline-text-5" id="text-org58d5c9c">
<p>
(Saltando, saltando, sa, sa, sa, saltando,&#x2026;}

). La función
F  ( x) =}
&infin;
X
{n=1}
1
2
n
1\{x &ge; r}
n
\, (26)}
donde r
1
, r
2
, &hellip; es un reordenamiento de los números racionales del intervalo (0, 1) con denom
inadores crecientes:
1
2
,
1
3
,
2
3
,
1
4
,
3
4
,
1
5
,
2
5
,
3
5
,
4
5
, &hellip; , tiene las siguientes propiedades es creciente,}
continua a derecha, lim<sub>x &rarr;−&infin;</sub>
F  ( x) = 0 y lím}
{x&rarr;&infin;}
F  ( x) = 1; tiene saltos en todos los números}
racionales del (0, 1) y es continua en los irracionales del (0, 1).
Pero no! Mejor no hablar de ciertas cosas &#x2026;
</p>
</div>
</div>
<div id="outline-container-orgab13a26" class="outline-5">
<h5 id="orgab13a26">Ejercicios adicionales</h5>
<div class="outline-text-5" id="text-orgab13a26">
<ol class="org-ol">
<li>Sea X una variable aleatoria con función de distribución F<sub>X</sub>(x). Mostrar que para cada</li>
</ol>
<p>
&alpha; &isin; (0}, 1) vale que}
sup\{x &isin; \Re : F}
X
(x) &lt; &alpha;{\} = mín\{x &isin; \Re : F}
X
(x) &ge; &alpha;\}.
16
</p>
</div>
</div>
</div>
<div id="outline-container-org633de9a" class="outline-3">
<h3 id="org633de9a">Función de distribución empírica e histogramas</h3>
<div class="outline-text-3" id="text-org633de9a">
<p>
Distribución empírica
La función de distribución empírica F
n
(x) de n puntos sobre la recta x
1
, &hellip; , x
n
es la
función escalera con saltos de altura 1{/n en los puntos x
1
, &hellip; , x
n
. En otras palabras, nF}
n
(x)
es igual a la cantidad de puntos x
k
en (−&infin;, x] y F}
n
(x) es una función de distribución:
F
n
(x) =
1
n
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">\{i = 1, &hellip; , n : x}</td>
</tr>
</tbody>
</table>
<p>
i
&le; x\}| =}
1
n
n
X
{i=1}
1\{x}
i
&le; x\. (27)}
</p>
</div>
<div id="outline-container-org7188893" class="outline-5">
<h5 id="org7188893">Nota Bene</h5>
<div class="outline-text-5" id="text-org7188893">
<p>
En la práctica, disponemos de conjuntos de observaciones (/"muestras'') corre
spondientes a un experimento considerado aleatorio y queremos extraer de ellas conclusiones
sobre los modelos que podrían cumplir. Dada una muestra x
1
, &hellip; , x
n
, la función de distribu
ción empírica F}
n
(x) coincide con la función de distribución de una variable aleatoria discreta
que concentra toda la masa en los valores x
1
, &hellip; , x
n
, dando a cada uno probabilidad 1{/n}.
</p>
</div>
</div>
