org/probabilidad/02_1.org
**** Observación 1.25. Sea F
n
(x) la función de distribución empírica correspondiente a una
muestra de n valores x
1
, \dots , x
n
. Sean a y b dos números reales tales que a < b}. Notar que
F
n
(b) − F
n
(a) =
1
n
n
X
{i=1}
1\{x}
i
\in (a, b]\} =}
1
n
|\{i = 1, \dots , n : x}
i
\in (a, b]\}|.
En consecuencia, el cociente incremental de F}
n
(x) sobre el intervalo [a, b] es la frecuencia
relativa de los valores de la muestra x
1
, \dots , x
n
contenidos en el intervalo (a, b] /"normalizada''
por la longitud de dicho intervalo:
F
n
(b) − F
n
(a)
b − a
=

1
b − a

1
n
n
X
{i=1}
1\{x}
i
\in (a, b]\}
!
. (28)
Notar que si los n valores, x
1
, \dots , x
n
, corresponden a n observaciones independientes de
los valores de una variable aleatoria X, la i
nterpretación intuitiva de la probabilidad indica
que el cociente incre mental (28) debería estar próximo del cociente incremental de la función
de distribución, F}
X
(x), de la variable aleatoria X sobre el intervalo [a, b]:
F
n
(b) − F
n
(a)
b − a
\approx
\mathbb{P}(a < X \leq b)
b − a
=
F
X
(b) − F
X
(a)
b − a
. (29)
Cuando X es una variable aleatoria absolutamente continua con función densidad continua
f_X(x) la aproximación (28) adopta la forma
F
n
(b) − F
n
(a)
b − a
\approx
1
b − a
Z
b
a
f_X(x)dx = f_X(x), (30)
donde x es algún punto perteneciente al intervalo (a, b).
17
Histogramas
Un histograma de una muestra x
1
, \dots , x
n
se obtiene eligiendo una partición en m intervalos
de extremos a
0
<  \cdots  < a
m
, con longitudes L}
j
= a
j
−a
j{−{1
; calculando las frecuencias relativas}
p
j
=
1
n
n
X
{i=1}
1\{a}
j{−{1
< x
i
< a
j
\}
y graficando la función igual a p
j
/L
j
en el intervalo (a
j{−{1
, a
j
] y a 0 fuera de los intervalos:
f
x
1
,...,x
n
; a
0
,...,a
m
(x) :=
m
X
{j=1}
p
j
L
j
1\{x \in (a
j{−{1
, a
j
]\. (31)
O sea, un conjunto de rectángulos con área p
j
.
Cuando la muestra x
1
, \dots , x
n
corresponde a n observaciones independientes de una vari
able aleatoria X absolutamente continua la función definida en (31) es una versión discreta
de la densidad de X en la que las áreas miden frecuencias relativas.
**** Ejercicios adicionales
4. Lucas filma vídeos de tamaños aleatorios. En una muestra aleatoria de 5 vídeos filmados}
por Lucas se obtuvieron los siguiente tamaños (en MB):
17, 21.3, 18.7, 21, 18.7
Hallar y graficar la función de distribución empírica asociada a esta muestra. Estimar, usando
la función de distribución empírica asociada a esta muestra, la probabilidad de que un vídeo
ocupe menos de 19.5 MB.
5. Los siguientes datos corresponden a los tiempos de funcionamiento (en años) hasta que}
ocurre la primer falla de una muestra de 12 máquinas industriales:
2.0087, 1.9067, 2.0195, 1.9242, 1.8885, 1.8098, 
1.9611, 2.0404, 2.1133, 2.0844, 2.1695, 1.9695.
Usando los intervalos con extremos 1.7, 1.9, 2.1, 2.3, hallar la función histograma basada en
la muestra observada e integrarla para estimar la probabilidad de que una máquina industrial
del mismo tipo funcione sin fallas durante menos de dos años.
**** Ejemplo 1.26. 
Sea T una variable aleatoria con distribución exponencial de intensidad 1}
(ver (14)). Esto es, T es una variable aleatoria absolutamente continua con función densidad
de probabilidad
f
T
(t) = e
−t_1\{t > 0}\}
y función de distribución
F
T
(t) =

1 − e}
−t

1\{t \geq 0\}.
18
De acuerdo con el esquema de la demostración del Teorema 1.19 podemos simular muestras de
T utilizando un generador de números aleatorios uniformemente distribuidos sobre el intervalo}
(0, 1). Concretamente, si U \sim \mathcal{U} (0, 1), entonces
ˆ
T = − log(1 − U ) 
es una variable con distribución exponencial de intensidad 1.
Para obtener una muestra de 10 valores t_1
, \dots , t_10
de una variable con distribución ex
ponencial de intensidad 1 generamos 10 números aleatorios u
1
, \dots , u
10
y los transformamos
poniendo t
i
= − log(1 − u}
i
). Por ejemplo, si los valores u
1
, \dots , u
10
son, respectivamente,
0.1406, 0.3159, 0.8613, 0.4334, 0.0595, 0.8859, 0.2560, 0.2876, 0.2239, 0.5912, 
los valores de la muestra obtenida, t_1
, \dots , t_10
, son, respectivamente,
0.1515, 0.3797, 1.9753, 0.5682, 0.0613, 2.1703, 0.2957, 0.3390, 0.2535, 0.8946. (32)
La función de distribución empírica de la muestra observada, F}
10
(t), es una función escalera
con saltos de altura 1 / 10 en los siguientes puntos del eje t:
0.0613, 0.1515, 0.2535, 0.2957, 0.3390, 0.3797, 0.5682, 0.8946, 1.9753, 2.1703.
Para construir un histograma usaremos la partición que se obtiene dividiendo en dos
intervalos de igual longitud el intervalo comprendido entre los valores mínimos y máximos
observados: 0.0613, 1.1158, 2.1703. La longitud L de cada intervalo es 1.0545. La frecuencia
relativa de la muestra sobre el primer intervalo es p
1
= 8 / 10 y sobre el segundo p
2
= 2 / 10 y
la correspondiente altura de cada rectángulo es p
1
/L = 0.75865 y p
2
/L = 0.18966.
0 1 2 3 4 5
0
0.1
0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
1
Empírica
Teórica
(a)
0 1 2 3 4 5 6 7
0
0.1
0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
1
Hitograma
Densidad
(b)
Figura 7: (a) Gráficos de la función de distribución empírica F}
10
(t) correspondiente a la
muestra dada en (32) y de la función de distribución de T . (b) Histograma correspondiente a
la misma muestra y gráfico de la densidad de T .
19
Para producir los gráficos de la Figura 7 usamos las siguientes rutinas en Octave.
Rutina para simular 10 valores de una exponencial de intensidad 1}
U=rand(1,10);
T=-log(1-U);
Rutina para graficar la función de distribución empírica de la muestra T}
t=sort(T);
s=empirical\_cdf(t,t);
stairs([t(1),t],[0 s])
Rutina para graficar un histograma de la muestra T}
[f,c]=hist(T,2);
p=f/10;
L=c(2)-c(1);
bar(c,p/L,1,'w')
Usando rutinas similares para muestras de tamaño 100 se obtienen los siguientes gráficos.
0 1 2 3 4 5 6 7
0
0.1
0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
1
Empírica
Teórica
(a)
0 1 2 3 4 5 6 7
0
0.1
0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
1
Hitograma
Densidad
(b)
Figura 8: (a) Gráficos de la función de distribución empírica F}
100
(t) correspondiente a una
muestra de tamaño 100 de una variable T con distribución exponencial de intensidad 1 y de
la función de distribución de T . (b) Histograma correspondiente a la misma muestra y gr
áfico
de la densidad de T .
20
* Variables truncadas
Sea X una variable aleatoria definida sobre un espacio de probabilidad $(\Omega, \mathcal{A},\mathbb{P})$. Sea
B \subset \Re un conjunto tal que X 
−{1}
(B) = \{\omega \in \Omega : X(\omega) \in B\} \in A y tal que \mathbb{P}(X \in B) > 0.
Truncar la variable aleatoria X al conjunto B significa condicionarla a tomar valores en
el conjunto B.
Mediante X | X \in B designaremos la variable aleatoria obtenida por truncar X al conjunto
B. Por definición, la función de distribución de X | X \in B es}
F
X | {X\in B}
(x) = \mathbb{P}(X \leq x{| X \in B) =
\mathbb{P}(X \leq x, X \in B)
\mathbb{P}(X \in B)
. (33)
Caso absolutamente continuo. Si la variable aleatoria X es absolutamente continua con
densidad de probabilidades f_X(x), la función de distribución de X | X \in B adopta la forma
F
X | {X\in B}
(x) =
R
\{X\leqx\}\cap\{X\inB\}
f_X(x)dx}
\mathbb{P}(X \in B)
=
R
x
−\infty
f_X(x)1\{x \in B\dx 
\mathbb{P}(X \in B)
. (34)
Por lo tanto, X | X \in B es una variable aleatoria absolutamente continua con densidad de
probabilidades
f
X | {X\in B}
(x) =
f_X(x)
\mathbb{P}(X \in B)
1\{x \in B\. (35) 
