probabilidad/02_1.html
<div id="outline-container-org2d7c781" class="outline-5">
<h5 id="org2d7c781">Observación 1.25. Sea F</h5>
<div class="outline-text-5" id="text-org2d7c781">
<p>
n
(x) la función de distribución empírica correspondiente a una
muestra de n valores x
1
, &hellip; , x
n
. Sean a y b dos números reales tales que a &lt; b}. Notar que
F
n
(b) − F
n
(a) =
1
n
n
X
{i=1}
1\{x}
i
&isin; (a, b]\} =}
1
n
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">\{i = 1, &hellip; , n : x}</td>
</tr>
</tbody>
</table>
<p>
i
&isin; (a, b]\}|.
En consecuencia, el cociente incremental de F}
n
(x) sobre el intervalo [a, b] es la frecuencia
relativa de los valores de la muestra x
1
, &hellip; , x
n
contenidos en el intervalo (a, b] /"normalizada''
por la longitud de dicho intervalo:
F
n
(b) − F
n
(a)
b − a
=
</p>

<p>
1
b − a

1
n
n
X
{i=1}
1\{x}
i
&isin; (a, b]\}
!
. (28)
Notar que si los n valores, x
1
, &hellip; , x
n
, corresponden a n observaciones independientes de
los valores de una variable aleatoria X, la i
nterpretación intuitiva de la probabilidad indica
que el cociente incre mental (28) debería estar próximo del cociente incremental de la función
de distribución, F}
X
(x), de la variable aleatoria X sobre el intervalo [a, b]:
F
n
(b) − F
n
(a)
b − a
&asymp;
\mathbb{P}(a &lt; X &le; b)
b − a
=
F
X
(b) − F
X
(a)
b − a
. (29)
Cuando X es una variable aleatoria absolutamente continua con función densidad continua
f<sub>X</sub>(x) la aproximación (28) adopta la forma
F
n
(b) − F
n
(a)
b − a
&asymp;
1
b − a
Z
b
a
f<sub>X</sub>(x)dx = f<sub>X</sub>(x), (30)
donde x es algún punto perteneciente al intervalo (a, b).
17
Histogramas
Un histograma de una muestra x
1
, &hellip; , x
n
se obtiene eligiendo una partición en m intervalos
de extremos a
0
&lt;  &ctdot;  &lt; a
m
, con longitudes L}
j
= a
j
−a
j{−{1
; calculando las frecuencias relativas}
p
j
=
1
n
n
X
{i=1}
1\{a}
j{−{1
&lt; x
i
&lt; a
j
\}
y graficando la función igual a p
j
/L
j
en el intervalo (a
j{−{1
, a
j
] y a 0 fuera de los intervalos:
f
x
1
,&#x2026;,x
n
; a
0
,&#x2026;,a
m
(x) :=
m
X
{j=1}
p
j
L
j
1\{x &isin; (a
j{−{1
, a
j
]\. (31)
O sea, un conjunto de rectángulos con área p
j
.
Cuando la muestra x
1
, &hellip; , x
n
corresponde a n observaciones independientes de una vari
able aleatoria X absolutamente continua la función definida en (31) es una versión discreta
de la densidad de X en la que las áreas miden frecuencias relativas.
</p>
</div>
</div>
<div id="outline-container-org2e8b648" class="outline-5">
<h5 id="org2e8b648">Ejercicios adicionales</h5>
<div class="outline-text-5" id="text-org2e8b648">
<ol class="org-ol">
<li>Lucas filma vídeos de tamaños aleatorios. En una muestra aleatoria de 5 vídeos filmados}</li>
</ol>
<p>
por Lucas se obtuvieron los siguiente tamaños (en MB):
17, 21.3, 18.7, 21, 18.7
Hallar y graficar la función de distribución empírica asociada a esta muestra. Estimar, usando
la función de distribución empírica asociada a esta muestra, la probabilidad de que un vídeo
ocupe menos de 19.5 MB.
</p>
<ol class="org-ol">
<li>Los siguientes datos corresponden a los tiempos de funcionamiento (en años) hasta que}</li>
</ol>
<p>
ocurre la primer falla de una muestra de 12 máquinas industriales:
2.0087, 1.9067, 2.0195, 1.9242, 1.8885, 1.8098, 
1.9611, 2.0404, 2.1133, 2.0844, 2.1695, 1.9695.
Usando los intervalos con extremos 1.7, 1.9, 2.1, 2.3, hallar la función histograma basada en
la muestra observada e integrarla para estimar la probabilidad de que una máquina industrial
del mismo tipo funcione sin fallas durante menos de dos años.
</p>
</div>
</div>
<div id="outline-container-org4a46cd5" class="outline-5">
<h5 id="org4a46cd5">Ejemplo 1.26.</h5>
<div class="outline-text-5" id="text-org4a46cd5">
<p>
Sea T una variable aleatoria con distribución exponencial de intensidad 1}
(ver (14)). Esto es, T es una variable aleatoria absolutamente continua con función densidad
de probabilidad
f
T
(t) = e
−t<sub>1</sub>\{t &gt; 0}\}
y función de distribución
F
T
(t) =

1 − e}
−t

1\{t &ge; 0\}.
18
De acuerdo con el esquema de la demostración del Teorema 1.19 podemos simular muestras de
T utilizando un generador de números aleatorios uniformemente distribuidos sobre el intervalo}
(0, 1). Concretamente, si U &sim; \mathcal{U} (0, 1), entonces
ˆ
T = − log(1 − U ) 
es una variable con distribución exponencial de intensidad 1.
Para obtener una muestra de 10 valores t<sub>1</sub>
, &hellip; , t<sub>10</sub>
de una variable con distribución ex
ponencial de intensidad 1 generamos 10 números aleatorios u
1
, &hellip; , u
10
y los transformamos
poniendo t
i
= − log(1 − u}
i
). Por ejemplo, si los valores u
1
, &hellip; , u
10
son, respectivamente,
0.1406, 0.3159, 0.8613, 0.4334, 0.0595, 0.8859, 0.2560, 0.2876, 0.2239, 0.5912, 
los valores de la muestra obtenida, t<sub>1</sub>
, &hellip; , t<sub>10</sub>
, son, respectivamente,
0.1515, 0.3797, 1.9753, 0.5682, 0.0613, 2.1703, 0.2957, 0.3390, 0.2535, 0.8946. (32)
La función de distribución empírica de la muestra observada, F}
10
(t), es una función escalera
con saltos de altura 1 / 10 en los siguientes puntos del eje t:
0.0613, 0.1515, 0.2535, 0.2957, 0.3390, 0.3797, 0.5682, 0.8946, 1.9753, 2.1703.
Para construir un histograma usaremos la partición que se obtiene dividiendo en dos
intervalos de igual longitud el intervalo comprendido entre los valores mínimos y máximos
observados: 0.0613, 1.1158, 2.1703. La longitud L de cada intervalo es 1.0545. La frecuencia
relativa de la muestra sobre el primer intervalo es p
1
= 8 / 10 y sobre el segundo p
2
= 2 / 10 y
la correspondiente altura de cada rectángulo es p
1
/L = 0.75865 y p
2
/L = 0.18966.
0 1 2 3 4 5
0
0.1
0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
1
Empírica
Teórica
(a)
0 1 2 3 4 5 6 7
0
0.1
0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
1
Hitograma
Densidad
(b)
Figura 7: (a) Gráficos de la función de distribución empírica F}
10
(t) correspondiente a la
muestra dada en (32) y de la función de distribución de T . (b) Histograma correspondiente a
la misma muestra y gráfico de la densidad de T .
19
Para producir los gráficos de la Figura 7 usamos las siguientes rutinas en Octave.
Rutina para simular 10 valores de una exponencial de intensidad 1}
U=rand(1,10);
T=-log(1-U);
Rutina para graficar la función de distribución empírica de la muestra T}
t=sort(T);
s=empirical\<sub>cdf</sub>(t,t);
stairs([t(1),t],[0 s])
Rutina para graficar un histograma de la muestra T}
[f,c]=hist(T,2);
p=f/10;
L=c(2)-c(1);
bar(c,p/L,1,'w')
Usando rutinas similares para muestras de tamaño 100 se obtienen los siguientes gráficos.
0 1 2 3 4 5 6 7
0
0.1
0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
1
Empírica
Teórica
(a)
0 1 2 3 4 5 6 7
0
0.1
0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
1
Hitograma
Densidad
(b)
Figura 8: (a) Gráficos de la función de distribución empírica F}
100
(t) correspondiente a una
muestra de tamaño 100 de una variable T con distribución exponencial de intensidad 1 y de
la función de distribución de T . (b) Histograma correspondiente a la misma muestra y gr
áfico
de la densidad de T .
20
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf89b669" class="outline-2">
<h2 id="orgf89b669">Variables truncadas</h2>
<div class="outline-text-2" id="text-orgf89b669">
<p>
Sea X una variable aleatoria definida sobre un espacio de probabilidad \((\Omega, \mathcal{A},\mathbb{P})\). Sea
B &sub; \Re un conjunto tal que X 
−{1}
(B) = \{&omega; &isin; &Omega; : X(&omega;) &isin; B\} &isin; A y tal que \mathbb{P}(X &isin; B) &gt; 0.
Truncar la variable aleatoria X al conjunto B significa condicionarla a tomar valores en
el conjunto B.
Mediante X | X &isin; B designaremos la variable aleatoria obtenida por truncar X al conjunto
B. Por definición, la función de distribución de X | X &isin; B es}
F
X | {X&isin; B}
(x) = \mathbb{P}(X &le; x{| X &isin; B) =
\mathbb{P}(X &le; x, X &isin; B)
\mathbb{P}(X &isin; B)
. (33)
Caso absolutamente continuo. Si la variable aleatoria X es absolutamente continua con
densidad de probabilidades f<sub>X</sub>(x), la función de distribución de X | X &isin; B adopta la forma
F
X | {X&isin; B}
(x) =
R
\{X\leqx\}&cap;\{X\inB\}
f<sub>X</sub>(x)dx}
\mathbb{P}(X &isin; B)
=
R
x
−&infin;
f<sub>X</sub>(x)1\{x &isin; B\dx 
\mathbb{P}(X &isin; B)
. (34)
Por lo tanto, X | X &isin; B es una variable aleatoria absolutamente continua con densidad de
probabilidades
f
X | {X&isin; B}
(x) =
f<sub>X</sub>(x)
\mathbb{P}(X &isin; B)
1\{x &isin; B\. (35) 
</p>
</div>
