org/probabilidad/02_1.org
**** Nota Bene 
La densidad condicional f}
X | {X\in B}
(x) es cero fuera del conjunto condicionante
B. Dentro del conjunto condicionante la densidad condicional tiene exactamente la misma}
forma que la densidad incondicional, salvo que está escalada por el factor de normalización
1{/\mathbb{P}(X \in B) que asegura que f
X{|\in}B
(x) integra 1.
**** Ejemplo 2.1 (Exponencial truncada a la derecha)
Sea T una variable aleatoria con distribu
ción exponencial de intensidad \lambda > 0 y sea t_0
> 0. Según la fórmula (35) la variable aleatoria}
T truncada a la semi-recta (t, +{\infty), T | T > t_0
, tiene la siguiente densidad de probabilidades
f
T | T >t_0
(t) =
\lambda e
−{\lambda t}
e
−{\lambda t}
0
1\{t > t_0
\} = e}
−{\lambda ( t}−t_0
)
1\{t − t}
0
> 0{\} = f
T
(t − t}
0
).
En otros términos, si T \sim Exp( \lambda ), entonces T | T > t}
0
\sim t_0
+Exp( \lambda ).
Caso discreto. El caso discreto se trata en forma análoga a la anterior. La función de}
probabilidad de X | X \in B adopta la forma
p
X | {X\in B}
(x) =
\mathbb{P}(X = x)
\mathbb{P}(X \in B)
1\{x \in B\. (36) 
**** Ejemplo 2.2 (Dado equilibrado). 
Sea X el resultado del tiro de un dado equilibrado y sea}
B = \2, 4, 6{\}. El evento /"el resultado del tiro es un número par"/ es X \in B}. Aplicando la 
fórmula anterior obtenemos
p
X | {X\in B}
(x) =
1 / 6
1 / 2
1\{x \in \{2, 4, 6\}\} =
1
3
1\{x \in \{2, 4, 6\}\. (37) 
21
** Perdida de memoria
**** Ejemplo 2.3. 
Lucas camina hacia la parada del colectivo. El tie mpo, T , entre llegadas}
de colectivos tiene distribución ex ponencial de intensidad \lambda}. Supongamos que Lucas llega t
minutos después de la llegada de un colectivo. Sea X el tiempo que Lucas tendrá que esperar
hasta que llegue el próximo colectivo. Cuál es la distribución del tiempo de espera X?
Designamos mediante A = \{T > t\} el evento /"Lucas llegó t minutos después de la llegada}
de un colectivo''. Tenemos que}
\mathbb{P}(X > x | A) = \mathbb{P}(T > t + x | T > t) =}
\mathbb{P}(T > t + x, T > t)
\mathbb{P}(T > t)
=
\mathbb{P}(T > t + x)
\mathbb{P}(T > t)
=
e
−{\lambda ( t{+}x ) 
e
−{\lambda t}
= e
−{\lambda x}
.
**** Definición 2.4. 
Se dice que una variable aleatoria T no tiene memoria, o pierde memoria, si 
\mathbb{P}(T > s + t | T > t) = \mathbb{P}(T > s) para todo s, t \geq 0. (38)
La condición de pérdida de memoria es equivalente a la siguiente
\mathbb{P}(T > s + t) = \mathbb{P}(T > s)\mathbb{P}(T > t). (39)
En efecto, basta observar que \mathbb{P}(T > s + t, T > t) = \mathbb{P}(T > s + t) y usar la definición de
probabilidad condicional.
**** Nota Bene 
Si se piensa que T es el tiempo para completar cierta operación, la ecuación}
(38) establece que si a tiempo t la operación no ha sido completada, la probabilidad de que
la operación no se complete a tiempo s + t es la misma que la probabilidad inicial de que la
operación no haya sido completada a tiempo s.
**** Lema 2.5. La variable exponencial no tiene memoria.
**** Demostración Si T \sim Exp( \lambda ), entonces}
\mathbb{P}(T > t) = e}
−{\lambda t}
para todo t \geq 0. (40)
Usando (40) se prueba inmediatamente que la e cuación (39) se satisface cuando T tiene
distribución exponencial (pues e
−{\lambda ( s{+}t ) 
= e
−{\lambda s}
e
−{\lambda t}
).
**** Nota Bene 
Si modelamos el tiempo para completar cierta operación por una variable}
aleatoria T con distribución exponencial, la propiedad de pérdida de memoria implica que
mientras la operación no haya sido completada, el tiempo restante para completarla tiene la
misma función de distribución, no importa cuando haya empezado la operación.
**** Ejemplo 2.6. 
Supongamos que el tiempo de espera para recibir un mensaje tenga distribu
ción exponencial de intensidad 1 / 10 minutos. Cuál es la probabilidad de que tengamos que
esperar más de 15 minutos para recibirlo? Cuál es la probabilidad de que tengamos que es
perar más de 15 minutos para recibir el mensaje dado que hace más de 10 minutos que lo
estamos esperando?
22
Si T representa el tiempo de espera, T \sim Exp(1 / 10). La primer probabilidad es
\mathbb{P}(T > 15) = e}
−
1
10
15
= e
−
3
2
\approx 0.220}
La segunda pregunta interroga por la probabilidad de que habiendo esperado 10 minutos
tengamos que esperar al menos 5 minutos más. Usando la propiedad de falta de memoria de
la exponencial, dicha probabilidad es
\mathbb{P}(T > 5) = e}
−
1
10
5
= e
−
1
2
\approx 0.604.
** Caracterización cualitativa de la distribución exponencial
La propiedad de pérdida de memoria caracteriza a la distribución exponencial.
**** Teorema 2.7. Sea T una variable aleatoria continua a valores en R
+
. Si T pierde memoria,
entonces T \sim Exp( \lambda ), donde \lambda = − log \mathbb{P}(T > 1).
**** Demostración (a la Cauchy). Sea G(t) := \mathbb{P}(T > t). De la ecuación (39) se deduce que}
G ( s + t) = G ( s ) G ( t ) . (41)
La única función continua a derecha que satisface la ecuación funcional (41) es
G ( t) = G(1)
t
. (42)
Para ello basta ver que G}

m
n

= G(1)
m
n
. Si vale (41), entonces G}

2
n

= G}

1
n
+
1
n

=
G

1
n

G

1
n

= G}

1
n

2
y repitiendo el argumento se puede ver que
G

m
n

= G}

1
n

m
. (43)
En particular, si m = n se obtiene G (1) = G}

1
n

n
. Equivalentemente,
G

1
n

= G(1)
1
n
(44)
De las identidades (43) y (44) se deduce que
G

m
n

= G(1)
m
n
. (45)
Ahora bien, debido a que G(1) = \mathbb{P}(T > 1) \in (0, 1), existe \lambda > 0 tal que G(1) = e
− \lambda 
(\lambda = − l og G(1)). Reemplazando en (42) se obtiene G(t) =

e
− \lambda 

t
= e
−{\lambda t}
.
** Dividir y conquistar
**** Teorema 2.8. Sea X una variable aleatoria absolutamente continua con densidad de proba
bilidades f_X(x). Sea (B
i
)
i \geq 1
una familia de subconjuntos disjuntos dos a dos de la recta real
tales que \{X \in B}
i
\} \in A y \mathbb{P}(X \in B
i
) > 0 para todo i \geq 1. Si \Omega = \cup}
i \geq 1
\{X \in B
i
\, entonces}
f_X(x) =
X
i \geq 1
f
X | {X\in B}
i
(x)\mathbb{P}(X \in B}
i
). (46)

**** Demostración 
Inmediata de la fórmula (35) y de observar que}
P
i \geq 1
1\{X \in B}
i
\} = 1.
