probabilidad/02_1.html
<div id="outline-container-orgdb850ff" class="outline-5">
<h5 id="orgdb850ff">Nota Bene</h5>
<div class="outline-text-5" id="text-orgdb850ff">
<p>
La densidad condicional f}
X | {X&isin; B}
(x) es cero fuera del conjunto condicionante
B. Dentro del conjunto condicionante la densidad condicional tiene exactamente la misma}
forma que la densidad incondicional, salvo que está escalada por el factor de normalización
1{/\mathbb{P}(X &isin; B) que asegura que f
X{|&isin;}B
(x) integra 1.
</p>
</div>
</div>
<div id="outline-container-orgfad27dc" class="outline-5">
<h5 id="orgfad27dc">Ejemplo 2.1 (Exponencial truncada a la derecha)</h5>
<div class="outline-text-5" id="text-orgfad27dc">
<p>
Sea T una variable aleatoria con distribu
ción exponencial de intensidad &lambda; &gt; 0 y sea t<sub>0</sub>
&gt; 0. Según la fórmula (35) la variable aleatoria}
T truncada a la semi-recta (t, +{&infin;), T | T &gt; t<sub>0</sub>
, tiene la siguiente densidad de probabilidades
f
T | T &gt;t<sub>0</sub>
(t) =
&lambda; e
−{&lambda; t}
e
−{&lambda; t}
0
1\{t &gt; t<sub>0</sub>
\} = e}
−{&lambda; ( t}−t<sub>0</sub>
)
1\{t − t}
0
&gt; 0{\} = f
T
(t − t}
0
).
En otros términos, si T &sim; Exp( &lambda; ), entonces T | T &gt; t}
0
&sim; t<sub>0</sub>
+Exp( &lambda; ).
Caso discreto. El caso discreto se trata en forma análoga a la anterior. La función de}
probabilidad de X | X &isin; B adopta la forma
p
X | {X&isin; B}
(x) =
\mathbb{P}(X = x)
\mathbb{P}(X &isin; B)
1\{x &isin; B\. (36) 
</p>
</div>
</div>
<div id="outline-container-org52218a2" class="outline-5">
<h5 id="org52218a2">Ejemplo 2.2 (Dado equilibrado).</h5>
<div class="outline-text-5" id="text-org52218a2">
<p>
Sea X el resultado del tiro de un dado equilibrado y sea}
B = \2, 4, 6{\}. El evento <i>"el resultado del tiro es un número par"</i> es X &isin; B}. Aplicando la 
fórmula anterior obtenemos
p
X | {X&isin; B}
(x) =
1 / 6
1 / 2
1\{x &isin; \{2, 4, 6\}\} =
1
3
1\{x &isin; \{2, 4, 6\}\. (37) 
21
</p>
</div>
</div>
<div id="outline-container-orga9b483c" class="outline-3">
<h3 id="orga9b483c">Perdida de memoria</h3>
<div class="outline-text-3" id="text-orga9b483c">
</div>
<div id="outline-container-org828163b" class="outline-5">
<h5 id="org828163b">Ejemplo 2.3.</h5>
<div class="outline-text-5" id="text-org828163b">
<p>
Lucas camina hacia la parada del colectivo. El tie mpo, T , entre llegadas}
de colectivos tiene distribución ex ponencial de intensidad &lambda;}. Supongamos que Lucas llega t
minutos después de la llegada de un colectivo. Sea X el tiempo que Lucas tendrá que esperar
hasta que llegue el próximo colectivo. Cuál es la distribución del tiempo de espera X?
Designamos mediante A = \{T &gt; t\} el evento /"Lucas llegó t minutos después de la llegada}
de un colectivo''. Tenemos que}
\mathbb{P}(X &gt; x | A) = \mathbb{P}(T &gt; t + x | T &gt; t) =}
\mathbb{P}(T &gt; t + x, T &gt; t)
\mathbb{P}(T &gt; t)
=
\mathbb{P}(T &gt; t + x)
\mathbb{P}(T &gt; t)
=
e
−{&lambda; ( t{+}x ) 
e
−{&lambda; t}
= e
−{&lambda; x}
.
</p>
</div>
</div>
<div id="outline-container-orga965d0c" class="outline-5">
<h5 id="orga965d0c">Definición 2.4.</h5>
<div class="outline-text-5" id="text-orga965d0c">
<p>
Se dice que una variable aleatoria T no tiene memoria, o pierde memoria, si 
\mathbb{P}(T &gt; s + t | T &gt; t) = \mathbb{P}(T &gt; s) para todo s, t &ge; 0. (38)
La condición de pérdida de memoria es equivalente a la siguiente
\mathbb{P}(T &gt; s + t) = \mathbb{P}(T &gt; s)\mathbb{P}(T &gt; t). (39)
En efecto, basta observar que \mathbb{P}(T &gt; s + t, T &gt; t) = \mathbb{P}(T &gt; s + t) y usar la definición de
probabilidad condicional.
</p>
</div>
</div>
<div id="outline-container-orgd921793" class="outline-5">
<h5 id="orgd921793">Nota Bene</h5>
<div class="outline-text-5" id="text-orgd921793">
<p>
Si se piensa que T es el tiempo para completar cierta operación, la ecuación}
(38) establece que si a tiempo t la operación no ha sido completada, la probabilidad de que
la operación no se complete a tiempo s + t es la misma que la probabilidad inicial de que la
operación no haya sido completada a tiempo s.
</p>
</div>
</div>
<div id="outline-container-org9ba2d56" class="outline-5">
<h5 id="org9ba2d56">Lema 2.5. La variable exponencial no tiene memoria.</h5>
</div>
<div id="outline-container-org2569b8a" class="outline-5">
<h5 id="org2569b8a">Demostración Si T &sim; Exp( &lambda; ), entonces}</h5>
<div class="outline-text-5" id="text-org2569b8a">
<p>
\mathbb{P}(T &gt; t) = e}
−{&lambda; t}
para todo t &ge; 0. (40)
Usando (40) se prueba inmediatamente que la e cuación (39) se satisface cuando T tiene
distribución exponencial (pues e
−{&lambda; ( s{+}t ) 
= e
−{&lambda; s}
e
−{&lambda; t}
).
</p>
</div>
</div>
<div id="outline-container-org97c64ae" class="outline-5">
<h5 id="org97c64ae">Nota Bene</h5>
<div class="outline-text-5" id="text-org97c64ae">
<p>
Si modelamos el tiempo para completar cierta operación por una variable}
aleatoria T con distribución exponencial, la propiedad de pérdida de memoria implica que
mientras la operación no haya sido completada, el tiempo restante para completarla tiene la
misma función de distribución, no importa cuando haya empezado la operación.
</p>
</div>
</div>
<div id="outline-container-org15d0c70" class="outline-5">
<h5 id="org15d0c70">Ejemplo 2.6.</h5>
<div class="outline-text-5" id="text-org15d0c70">
<p>
Supongamos que el tiempo de espera para recibir un mensaje tenga distribu
ción exponencial de intensidad 1 / 10 minutos. Cuál es la probabilidad de que tengamos que
esperar más de 15 minutos para recibirlo? Cuál es la probabilidad de que tengamos que es
perar más de 15 minutos para recibir el mensaje dado que hace más de 10 minutos que lo
estamos esperando?
22
Si T representa el tiempo de espera, T &sim; Exp(1 / 10). La primer probabilidad es
\mathbb{P}(T &gt; 15) = e}
−
1
10
15
= e
−
3
2
&asymp; 0.220}
La segunda pregunta interroga por la probabilidad de que habiendo esperado 10 minutos
tengamos que esperar al menos 5 minutos más. Usando la propiedad de falta de memoria de
la exponencial, dicha probabilidad es
\mathbb{P}(T &gt; 5) = e}
−
1
10
5
= e
−
1
2
&asymp; 0.604.
</p>
</div>
</div>
</div>
<div id="outline-container-org6fe71b2" class="outline-3">
<h3 id="org6fe71b2">Caracterización cualitativa de la distribución exponencial</h3>
<div class="outline-text-3" id="text-org6fe71b2">
<p>
La propiedad de pérdida de memoria caracteriza a la distribución exponencial.
</p>
</div>
<div id="outline-container-org9671ba1" class="outline-5">
<h5 id="org9671ba1">Teorema 2.7. Sea T una variable aleatoria continua a valores en R</h5>
<div class="outline-text-5" id="text-org9671ba1">
<ul class="org-ul">
<li></li>
</ul>
<p>
. Si T pierde memoria,
entonces T &sim; Exp( &lambda; ), donde &lambda; = − log \mathbb{P}(T &gt; 1).
</p>
</div>
</div>
<div id="outline-container-orgaa787dc" class="outline-5">
<h5 id="orgaa787dc">Demostración (a la Cauchy). Sea G(t) := \mathbb{P}(T &gt; t). De la ecuación (39) se deduce que}</h5>
<div class="outline-text-5" id="text-orgaa787dc">
<p>
G ( s + t) = G ( s ) G ( t ) . (41)
La única función continua a derecha que satisface la ecuación funcional (41) es
G ( t) = G(1)
t
. (42)
Para ello basta ver que G}

m
n

= G(1)
m
n
. Si vale (41), entonces G}

2
n

= G}

1
n
</p>
<ul class="org-ul">
<li></li>
</ul>
<p>
1
n

=
G

1
n

G

1
n

= G}

1
n

2
y repitiendo el argumento se puede ver que
G

m
n

= G}
</p>

<p>
1
n

m
. (43)
En particular, si m = n se obtiene G (1) = G}

1
n

n
. Equivalentemente,
G
</p>

<p>
1
n

= G(1)
1
n
(44)
De las identidades (43) y (44) se deduce que
G

m
n

= G(1)
m
n
. (45)
Ahora bien, debido a que G(1) = \mathbb{P}(T &gt; 1) &isin; (0, 1), existe &lambda; &gt; 0 tal que G(1) = e
− &lambda; 
(&lambda; = − l og G(1)). Reemplazando en (42) se obtiene G(t) =

e
− &lambda; 

t
= e
−{&lambda; t}
.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc76e70d" class="outline-3">
<h3 id="orgc76e70d">Dividir y conquistar</h3>
<div class="outline-text-3" id="text-orgc76e70d">
</div>
<div id="outline-container-org6ad5f07" class="outline-5">
<h5 id="org6ad5f07">Teorema 2.8. Sea X una variable aleatoria absolutamente continua con densidad de proba</h5>
<div class="outline-text-5" id="text-org6ad5f07">
<p>
bilidades f<sub>X</sub>(x). Sea (B
i
)
i &ge; 1
una familia de subconjuntos disjuntos dos a dos de la recta real
tales que \{X &isin; B}
i
\} &isin; A y \mathbb{P}(X &isin; B
i
) &gt; 0 para todo i &ge; 1. Si &Omega; = &cup;}
i &ge; 1
\{X &isin; B
i
\, entonces}
f<sub>X</sub>(x) =
X
i &ge; 1
f
X | {X&isin; B}
i
(x)\mathbb{P}(X &isin; B}
i
). (46)
</p>
</div>
</div>

<div id="outline-container-orgf4e2ca7" class="outline-5">
<h5 id="orgf4e2ca7">Demostración</h5>
<div class="outline-text-5" id="text-orgf4e2ca7">
<p>
Inmediata de la fórmula (35) y de observar que}
P
i &ge; 1
1\{X &isin; B}
i
\} = 1.
</p>
</div>
</div>
