org/probabilidad/02_1.org
**** Ejemplo 2.9 (Dividir y conquistar). Todas las mañanas Lucas l lega a la estación del subte}
entre las 7:10 y las 7:30 (con distribución uniforme en el intervalo). El subte llega a la estación
cada quince minutos comenzando a las 6:00. ¿Cuál es la densidad de probabilidades del tiempo
que tiene que esperar Lucas hasta subirse al subte?
Sea X el tiempo de llegada de Lucas a la estación del subte, X \sim \mathcal{U} [7:10, 7:30]. Sea Y
el tiempo de espera. Consideramos los eventos A = \7:10 \leq X \leq 7:15{\} = ''Lucas sube en el}
subte de las 7:15''; B = \7:15 < X \leq 7:30{\} = ''Lucas sube en el subte de las 7:30''.
Condicionado al evento A, el tiempo de llegada de Lucas a la estación del subte es uniforme
entre las 7:10 y las 7:15. En en ese caso, el tiempo de esp era Y es uniforme entre 0 y 5 minutos.
Análogamente, condicionado al evento B, Y es uniforme entre 0 y 15 minutos. La densidad
de probabilidades de Y se obtiene dividiendo y conquistando
f_Y(y) =

5
20

1
5
1\{0 \leq y \leq 5\} +

15
20

1
15
1\{0 \leq y \leq 15\}
=
1
10
1\{0 \leq y \leq 5\} +
1
20
1\{5 \leq y \leq 15\}.
* Bibliografía consultada
Para redactar estas notas se consultaron los siguientes libros:
1. Bertsekas, D. P., Tsitsiklis, J. N.: Introduction to Probability. M.I.T. Lecture Notes.
(2000)
2. Chung, K. L.: A Course in Probability Theory. Academic Press, San Diego. (2001)
3. Durrett R.:Probability.Theory and Examples. Duxbury Press, Belmont. (1996)
4. Feller, W.: An introduction to Probability Theory and Its Applications. Vol. 1. John
Wiley & Sons, New York. (1968)
5. Feller, W.: An introduction to Probability Theory and Its Applications. Vol. 2. John
Wiley & Sons, New York. (1971)
6. Grimmett, G. R., Stirzaker, D. R.: Probability and Random Processes. Oxford Univer
sity Press, New York. (2001)
7. Johnson, N. L., Kotz, S., Balakrishnan, N.: Continuous Univariate Distributions. Vol.
1. John Wiley & Sons, New York. (1995)
8. Kolmogorov, A. N.: Foundations of the Theory of Probability. Chelsea Publishing Co.,
New York. (1956)
9. Maronna R.: Probabilidad y Estadística Elementales para Estudiantes de Ciencias. Ed
itorial Exacta, La Plata. (1995).
10. Pugachev, V. S.: Introducción a la Teoría de las Probabilidades. Mir, Moscú. (1973)
11. Ross, S.: Introduction to Probability Models. Academic Press, San Diego. (2007)
24
 
 
 
 
 
 
 
 





