probabilidad/02_1.html
<div id="outline-container-org7d33423" class="outline-5">
<h5 id="org7d33423">Ejemplo 2.9 (Dividir y conquistar). Todas las mañanas Lucas l lega a la estación del subte}</h5>
<div class="outline-text-5" id="text-org7d33423">
<p>
entre las 7:10 y las 7:30 (con distribución uniforme en el intervalo). El subte llega a la estación
cada quince minutos comenzando a las 6:00. ¿Cuál es la densidad de probabilidades del tiempo
que tiene que esperar Lucas hasta subirse al subte?
Sea X el tiempo de llegada de Lucas a la estación del subte, X &sim; \mathcal{U} [7:10, 7:30]. Sea Y
el tiempo de espera. Consideramos los eventos A = \7:10 &le; X &le; 7:15{\} = ''Lucas sube en el}
subte de las 7:15''; B = \7:15 &lt; X &le; 7:30{\} = ''Lucas sube en el subte de las 7:30''.
Condicionado al evento A, el tiempo de llegada de Lucas a la estación del subte es uniforme
entre las 7:10 y las 7:15. En en ese caso, el tiempo de esp era Y es uniforme entre 0 y 5 minutos.
Análogamente, condicionado al evento B, Y es uniforme entre 0 y 15 minutos. La densidad
de probabilidades de Y se obtiene dividiendo y conquistando
f<sub>Y</sub>(y) =
</p>

<p>
5
20

1
5
1\{0 &le; y &le; 5\} +
</p>

<p>
15
20

1
15
1\{0 &le; y &le; 15\}
=
1
10
1\{0 &le; y &le; 5\} +
1
20
1\{5 &le; y &le; 15\}.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org5b32511" class="outline-2">
<h2 id="org5b32511">Bibliografía consultada</h2>
<div class="outline-text-2" id="text-org5b32511">
<p>
Para redactar estas notas se consultaron los siguientes libros:
</p>
<ol class="org-ol">
<li>Bertsekas, D. P., Tsitsiklis, J. N.: Introduction to Probability. M.I.T. Lecture Notes.</li>
</ol>
<p>
(2000)
</p>
<ol class="org-ol">
<li>Chung, K. L.: A Course in Probability Theory. Academic Press, San Diego. (2001)</li>
<li>Durrett R.:Probability.Theory and Examples. Duxbury Press, Belmont. (1996)</li>
<li>Feller, W.: An introduction to Probability Theory and Its Applications. Vol. 1. John</li>
</ol>
<p>
Wiley &amp; Sons, New York. (1968)
</p>
<ol class="org-ol">
<li>Feller, W.: An introduction to Probability Theory and Its Applications. Vol. 2. John</li>
</ol>
<p>
Wiley &amp; Sons, New York. (1971)
</p>
<ol class="org-ol">
<li>Grimmett, G. R., Stirzaker, D. R.: Probability and Random Processes. Oxford Univer</li>
</ol>
<p>
sity Press, New York. (2001)
</p>
<ol class="org-ol">
<li>Johnson, N. L., Kotz, S., Balakrishnan, N.: Continuous Univariate Distributions. Vol.</li>
<li>John Wiley &amp; Sons, New York. (1995)</li>
<li>Kolmogorov, A. N.: Foundations of the Theory of Probability. Chelsea Publishing Co.,</li>
</ol>
<p>
New York. (1956)
</p>
<ol class="org-ol">
<li>Maronna R.: Probabilidad y Estadística Elementales para Estudiantes de Ciencias. Ed</li>
</ol>
<p>
itorial Exacta, La Plata. (1995).
</p>
<ol class="org-ol">
<li>Pugachev, V. S.: Introducción a la Teoría de las Probabilidades. Mir, Moscú. (1973)</li>
<li>Ross, S.: Introduction to Probability Models. Academic Press, San Diego. (2007)</li>
</ol>
<p>
24
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2019-03-18 00:16
</div>
</body>
</html>
